minichao9901/my_stm32_projects/stm32h750_simple_reg/CORE/stm32h750_typedefs.h
#include <stdint.h>
typedef __IO volatile;

typedef struct {
	__IO union {
			struct {
				uint32_t MBKEN:1;
				uint32_t MUXEN:1;
				uint32_t MTYP:2;
				uint32_t MWID:2;
				uint32_t FACCEN:1;
				uint32_t RESERVED7:1;
				uint32_t BURSTEN:1;
				uint32_t WAITPOL:1;
				uint32_t RESERVED10:1;
				uint32_t WAITCFG:1;
				uint32_t WREN:1;
				uint32_t WAITEN:1;
				uint32_t EXTMOD:1;
				uint32_t ASYNCWAIT:1;
				uint32_t CPSIZE:3;
				uint32_t CBURSTRW:1;
				uint32_t CCLKEN:1;
				uint32_t WFDIS:1;
				uint32_t RESERVED22:2;
				uint32_t BMAP:2;
				uint32_t RESERVED26:5;
				uint32_t FMCEN:1;
			};
			uint32_t val;
		} BCR1;
	__IO union {
			struct {
				uint32_t ADDSET:4;
				uint32_t ADDHLD:4;
				uint32_t DATAST:8;
				uint32_t BUSTURN:4;
				uint32_t CLKDIV:4;
				uint32_t DATLAT:4;
				uint32_t ACCMOD:2;
				uint32_t RESERVED30:2;
			};
			uint32_t val;
		} BTR1;
	__IO union {
			struct {
				uint32_t MBKEN:1;
				uint32_t MUXEN:1;
				uint32_t MTYP:2;
				uint32_t MWID:2;
				uint32_t FACCEN:1;
				uint32_t RESERVED7:1;
				uint32_t BURSTEN:1;
				uint32_t WAITPOL:1;
				uint32_t RESERVED10:1;
				uint32_t WAITCFG:1;
				uint32_t WREN:1;
				uint32_t WAITEN:1;
				uint32_t EXTMOD:1;
				uint32_t ASYNCWAIT:1;
				uint32_t CPSIZE:3;
				uint32_t CBURSTRW:1;
				uint32_t CCLKEN:1;
				uint32_t WFDIS:1;
				uint32_t RESERVED22:2;
				uint32_t BMAP:2;
				uint32_t RESERVED26:5;
				uint32_t FMCEN:1;
			};
			uint32_t val;
		} BCR2;
	__IO union {
			struct {
				uint32_t ADDSET:4;
				uint32_t ADDHLD:4;
				uint32_t DATAST:8;
				uint32_t BUSTURN:4;
				uint32_t CLKDIV:4;
				uint32_t DATLAT:4;
				uint32_t ACCMOD:2;
				uint32_t RESERVED30:2;
			};
			uint32_t val;
		} BTR2;
	__IO union {
			struct {
				uint32_t MBKEN:1;
				uint32_t MUXEN:1;
				uint32_t MTYP:2;
				uint32_t MWID:2;
				uint32_t FACCEN:1;
				uint32_t RESERVED7:1;
				uint32_t BURSTEN:1;
				uint32_t WAITPOL:1;
				uint32_t RESERVED10:1;
				uint32_t WAITCFG:1;
				uint32_t WREN:1;
				uint32_t WAITEN:1;
				uint32_t EXTMOD:1;
				uint32_t ASYNCWAIT:1;
				uint32_t CPSIZE:3;
				uint32_t CBURSTRW:1;
				uint32_t CCLKEN:1;
				uint32_t WFDIS:1;
				uint32_t RESERVED22:2;
				uint32_t BMAP:2;
				uint32_t RESERVED26:5;
				uint32_t FMCEN:1;
			};
			uint32_t val;
		} BCR3;
	__IO union {
			struct {
				uint32_t ADDSET:4;
				uint32_t ADDHLD:4;
				uint32_t DATAST:8;
				uint32_t BUSTURN:4;
				uint32_t CLKDIV:4;
				uint32_t DATLAT:4;
				uint32_t ACCMOD:2;
				uint32_t RESERVED30:2;
			};
			uint32_t val;
		} BTR3;
	__IO union {
			struct {
				uint32_t MBKEN:1;
				uint32_t MUXEN:1;
				uint32_t MTYP:2;
				uint32_t MWID:2;
				uint32_t FACCEN:1;
				uint32_t RESERVED7:1;
				uint32_t BURSTEN:1;
				uint32_t WAITPOL:1;
				uint32_t RESERVED10:1;
				uint32_t WAITCFG:1;
				uint32_t WREN:1;
				uint32_t WAITEN:1;
				uint32_t EXTMOD:1;
				uint32_t ASYNCWAIT:1;
				uint32_t CPSIZE:3;
				uint32_t CBURSTRW:1;
				uint32_t CCLKEN:1;
				uint32_t WFDIS:1;
				uint32_t RESERVED22:2;
				uint32_t BMAP:2;
				uint32_t RESERVED26:5;
				uint32_t FMCEN:1;
			};
			uint32_t val;
		} BCR4;
	__IO union {
			struct {
				uint32_t ADDSET:4;
				uint32_t ADDHLD:4;
				uint32_t DATAST:8;
				uint32_t BUSTURN:4;
				uint32_t CLKDIV:4;
				uint32_t DATLAT:4;
				uint32_t ACCMOD:2;
				uint32_t RESERVED30:2;
			};
			uint32_t val;
		} BTR4;
	uint32_t RESERVED8;
	uint32_t RESERVED9;
	uint32_t RESERVED10;
	uint32_t RESERVED11;
	uint32_t RESERVED12;
	uint32_t RESERVED13;
	uint32_t RESERVED14;
	uint32_t RESERVED15;
	uint32_t RESERVED16;
	uint32_t RESERVED17;
	uint32_t RESERVED18;
	uint32_t RESERVED19;
	uint32_t RESERVED20;
	uint32_t RESERVED21;
	uint32_t RESERVED22;
	uint32_t RESERVED23;
	uint32_t RESERVED24;
	uint32_t RESERVED25;
	uint32_t RESERVED26;
	uint32_t RESERVED27;
	uint32_t RESERVED28;
	uint32_t RESERVED29;
	uint32_t RESERVED30;
	uint32_t RESERVED31;
	__IO union {
			struct {
				uint32_t RESERVED0:1;
				uint32_t PWAITEN:1;
				uint32_t PBKEN:1;
				uint32_t RESERVED3:1;
				uint32_t PWID:2;
				uint32_t ECCEN:1;
				uint32_t RESERVED7:2;
				uint32_t TCLR:4;
				uint32_t TAR:4;
				uint32_t ECCPS:3;
				uint32_t RESERVED20:12;
			};
			uint32_t val;
		} PCR;
	__IO union {
			struct {
				uint32_t IRS:1;
				uint32_t ILS:1;
				uint32_t IFS:1;
				uint32_t IREN:1;
				uint32_t ILEN:1;
				uint32_t IFEN:1;
				uint32_t FEMPT:1;
				uint32_t RESERVED7:25;
			};
			uint32_t val;
		} SR;
	__IO union {
			struct {
				uint32_t MEMSET:8;
				uint32_t MEMWAIT:8;
				uint32_t MEMHOLD:8;
				uint32_t MEMHIZ:8;
			};
			uint32_t val;
		} PMEM;
	__IO union {
			struct {
				uint32_t ATTSET:8;
				uint32_t ATTWAIT:8;
				uint32_t ATTHOLD:8;
				uint32_t ATTHIZ:8;
			};
			uint32_t val;
		} PATT;
	uint32_t RESERVED36;
	__IO union {
			struct {
				uint32_t ECC:32;
			};
			uint32_t val;
		} ECCR;
	uint32_t RESERVED38;
	uint32_t RESERVED39;
	uint32_t RESERVED40;
	uint32_t RESERVED41;
	uint32_t RESERVED42;
	uint32_t RESERVED43;
	uint32_t RESERVED44;
	uint32_t RESERVED45;
	uint32_t RESERVED46;
	uint32_t RESERVED47;
	uint32_t RESERVED48;
	uint32_t RESERVED49;
	uint32_t RESERVED50;
	uint32_t RESERVED51;
	uint32_t RESERVED52;
	uint32_t RESERVED53;
	uint32_t RESERVED54;
	uint32_t RESERVED55;
	uint32_t RESERVED56;
	uint32_t RESERVED57;
	uint32_t RESERVED58;
	uint32_t RESERVED59;
	uint32_t RESERVED60;
	uint32_t RESERVED61;
	uint32_t RESERVED62;
	uint32_t RESERVED63;
	uint32_t RESERVED64;
	__IO union {
			struct {
				uint32_t ADDSET:4;
				uint32_t ADDHLD:4;
				uint32_t DATAST:8;
				uint32_t BUSTURN:4;
				uint32_t RESERVED20:8;
				uint32_t ACCMOD:2;
				uint32_t RESERVED30:2;
			};
			uint32_t val;
		} BWTR1;
	uint32_t RESERVED66;
	__IO union {
			struct {
				uint32_t ADDSET:4;
				uint32_t ADDHLD:4;
				uint32_t DATAST:8;
				uint32_t BUSTURN:4;
				uint32_t RESERVED20:8;
				uint32_t ACCMOD:2;
				uint32_t RESERVED30:2;
			};
			uint32_t val;
		} BWTR2;
	uint32_t RESERVED68;
	__IO union {
			struct {
				uint32_t ADDSET:4;
				uint32_t ADDHLD:4;
				uint32_t DATAST:8;
				uint32_t BUSTURN:4;
				uint32_t RESERVED20:8;
				uint32_t ACCMOD:2;
				uint32_t RESERVED30:2;
			};
			uint32_t val;
		} BWTR3;
	uint32_t RESERVED70;
	__IO union {
			struct {
				uint32_t ADDSET:4;
				uint32_t ADDHLD:4;
				uint32_t DATAST:8;
				uint32_t BUSTURN:4;
				uint32_t RESERVED20:8;
				uint32_t ACCMOD:2;
				uint32_t RESERVED30:2;
			};
			uint32_t val;
		} BWTR4;
	uint32_t RESERVED72;
	uint32_t RESERVED73;
	uint32_t RESERVED74;
	uint32_t RESERVED75;
	uint32_t RESERVED76;
	uint32_t RESERVED77;
	uint32_t RESERVED78;
	uint32_t RESERVED79;
	__IO union {
			struct {
				uint32_t NC:2;
				uint32_t NR:2;
				uint32_t MWID:2;
				uint32_t NB:1;
				uint32_t CAS:2;
				uint32_t WP:1;
				uint32_t SDCLK:2;
				uint32_t RBURST:1;
				uint32_t RPIPE:2;
				uint32_t RESERVED15:17;
			};
			uint32_t val;
		} SDCR1;
	__IO union {
			struct {
				uint32_t NC:2;
				uint32_t NR:2;
				uint32_t MWID:2;
				uint32_t NB:1;
				uint32_t CAS:2;
				uint32_t WP:1;
				uint32_t SDCLK:2;
				uint32_t RBURST:1;
				uint32_t RPIPE:2;
				uint32_t RESERVED15:17;
			};
			uint32_t val;
		} SDCR2;
	__IO union {
			struct {
				uint32_t TMRD:4;
				uint32_t TXSR:4;
				uint32_t TRAS:4;
				uint32_t TRC:4;
				uint32_t TWR:4;
				uint32_t TRP:4;
				uint32_t TRCD:4;
				uint32_t RESERVED28:4;
			};
			uint32_t val;
		} SDTR1;
	__IO union {
			struct {
				uint32_t TMRD:4;
				uint32_t TXSR:4;
				uint32_t TRAS:4;
				uint32_t TRC:4;
				uint32_t TWR:4;
				uint32_t TRP:4;
				uint32_t TRCD:4;
				uint32_t RESERVED28:4;
			};
			uint32_t val;
		} SDTR2;
	__IO union {
			struct {
				uint32_t MODE:3;
				uint32_t CTB2:1;
				uint32_t CTB1:1;
				uint32_t NRFS:4;
				uint32_t MRD:14;
				uint32_t RESERVED23:9;
			};
			uint32_t val;
		} SDCMR;
	__IO union {
			struct {
				uint32_t CRE:1;
				uint32_t COUNT:13;
				uint32_t REIE:1;
				uint32_t RESERVED15:17;
			};
			uint32_t val;
		} SDRTR;
	__IO union {
			struct {
				uint32_t RE:1;
				uint32_t MODES1:2;
				uint32_t MODES2:2;
				uint32_t RESERVED5:27;
			};
			uint32_t val;
		} SDSR;
} MyFMC_TypeDef;

