minichao9901/my_stm32_projects/stm32h750_simple_reg/CORE/stm32h750_typedefs.h
typedef struct {
	__IO union {
			struct {
				uint32_t MODE0:2;
				uint32_t MODE1:2;
				uint32_t MODE2:2;
				uint32_t MODE3:2;
				uint32_t MODE4:2;
				uint32_t MODE5:2;
				uint32_t MODE6:2;
				uint32_t MODE7:2;
				uint32_t MODE8:2;
				uint32_t MODE9:2;
				uint32_t MODE10:2;
				uint32_t MODE11:2;
				uint32_t MODE12:2;
				uint32_t MODE13:2;
				uint32_t MODE14:2;
				uint32_t MODE15:2;
			};
			uint32_t val;
		} MODER;
	__IO union {
			struct {
				uint32_t OT0:1;
				uint32_t OT1:1;
				uint32_t OT2:1;
				uint32_t OT3:1;
				uint32_t OT4:1;
				uint32_t OT5:1;
				uint32_t OT6:1;
				uint32_t OT7:1;
				uint32_t OT8:1;
				uint32_t OT9:1;
				uint32_t OT10:1;
				uint32_t OT11:1;
				uint32_t OT12:1;
				uint32_t OT13:1;
				uint32_t OT14:1;
				uint32_t OT15:1;
				uint32_t RESERVED16:16;
			};
			uint32_t val;
		} OTYPER;
	__IO union {
			struct {
				uint32_t OSPEED0:2;
				uint32_t OSPEED1:2;
				uint32_t OSPEED2:2;
				uint32_t OSPEED3:2;
				uint32_t OSPEED4:2;
				uint32_t OSPEED5:2;
				uint32_t OSPEED6:2;
				uint32_t OSPEED7:2;
				uint32_t OSPEED8:2;
				uint32_t OSPEED9:2;
				uint32_t OSPEED10:2;
				uint32_t OSPEED11:2;
				uint32_t OSPEED12:2;
				uint32_t OSPEED13:2;
				uint32_t OSPEED14:2;
				uint32_t OSPEED15:2;
			};
			uint32_t val;
		} OSPEEDR;
	__IO union {
			struct {
				uint32_t PUPD0:2;
				uint32_t PUPD1:2;
				uint32_t PUPD2:2;
				uint32_t PUPD3:2;
				uint32_t PUPD4:2;
				uint32_t PUPD5:2;
				uint32_t PUPD6:2;
				uint32_t PUPD7:2;
				uint32_t PUPD8:2;
				uint32_t PUPD9:2;
				uint32_t PUPD10:2;
				uint32_t PUPD11:2;
				uint32_t PUPD12:2;
				uint32_t PUPD13:2;
				uint32_t PUPD14:2;
				uint32_t PUPD15:2;
			};
			uint32_t val;
		} PUPDR;
	__IO union {
			struct {
				uint32_t ID0:1;
				uint32_t ID1:1;
				uint32_t ID2:1;
				uint32_t ID3:1;
				uint32_t ID4:1;
				uint32_t ID5:1;
				uint32_t ID6:1;
				uint32_t ID7:1;
				uint32_t ID8:1;
				uint32_t ID9:1;
				uint32_t ID10:1;
				uint32_t ID11:1;
				uint32_t ID12:1;
				uint32_t ID13:1;
				uint32_t ID14:1;
				uint32_t ID15:1;
				uint32_t RESERVED16:16;
			};
			uint32_t val;
		} IDR;
	__IO union {
			struct {
				uint32_t OD0:1;
				uint32_t OD1:1;
				uint32_t OD2:1;
				uint32_t OD3:1;
				uint32_t OD4:1;
				uint32_t OD5:1;
				uint32_t OD6:1;
				uint32_t OD7:1;
				uint32_t OD8:1;
				uint32_t OD9:1;
				uint32_t OD10:1;
				uint32_t OD11:1;
				uint32_t OD12:1;
				uint32_t OD13:1;
				uint32_t OD14:1;
				uint32_t OD15:1;
				uint32_t RESERVED16:16;
			};
			uint32_t val;
		} ODR;
	__IO union {
			struct {
				uint32_t BS0:1;
				uint32_t BS1:1;
				uint32_t BS2:1;
				uint32_t BS3:1;
				uint32_t BS4:1;
				uint32_t BS5:1;
				uint32_t BS6:1;
				uint32_t BS7:1;
				uint32_t BS8:1;
				uint32_t BS9:1;
				uint32_t BS10:1;
				uint32_t BS11:1;
				uint32_t BS12:1;
				uint32_t BS13:1;
				uint32_t BS14:1;
				uint32_t BS15:1;
				uint32_t BR0:1;
				uint32_t BR1:1;
				uint32_t BR2:1;
				uint32_t BR3:1;
				uint32_t BR4:1;
				uint32_t BR5:1;
				uint32_t BR6:1;
				uint32_t BR7:1;
				uint32_t BR8:1;
				uint32_t BR9:1;
				uint32_t BR10:1;
				uint32_t BR11:1;
				uint32_t BR12:1;
				uint32_t BR13:1;
				uint32_t BR14:1;
				uint32_t BR15:1;
			};
			uint32_t val;
		} BSRR;
	__IO union {
			struct {
				uint32_t LCK0:1;
				uint32_t LCK1:1;
				uint32_t LCK2:1;
				uint32_t LCK3:1;
				uint32_t LCK4:1;
				uint32_t LCK5:1;
				uint32_t LCK6:1;
				uint32_t LCK7:1;
				uint32_t LCK8:1;
				uint32_t LCK9:1;
				uint32_t LCK10:1;
				uint32_t LCK11:1;
				uint32_t LCK12:1;
				uint32_t LCK13:1;
				uint32_t LCK14:1;
				uint32_t LCK15:1;
				uint32_t LCKK:1;
				uint32_t RESERVED17:15;
			};
			uint32_t val;
		} LCKR;
	__IO union {
			struct {
				uint32_t AFSEL0:4;
				uint32_t AFSEL1:4;
				uint32_t AFSEL2:4;
				uint32_t AFSEL3:4;
				uint32_t AFSEL4:4;
				uint32_t AFSEL5:4;
				uint32_t AFSEL6:4;
				uint32_t AFSEL7:4;
			};
			uint32_t val;
		} AFRL;
	__IO union {
			struct {
				uint32_t AFSEL8:4;
				uint32_t AFSEL9:4;
				uint32_t AFSEL10:4;
				uint32_t AFSEL11:4;
				uint32_t AFSEL12:4;
				uint32_t AFSEL13:4;
				uint32_t AFSEL14:4;
				uint32_t AFSEL15:4;
			};
			uint32_t val;
		} AFRH;
} MyGPIOA_TypeDef;

//typedef struct {
//} MyGPIOB_TypeDef;

//typedef struct {
//} MyGPIOC_TypeDef;

//typedef struct {
//} MyGPIOD_TypeDef;

//typedef struct {
//} MyGPIOE_TypeDef;

//typedef struct {
//} MyGPIOF_TypeDef;

//typedef struct {
//} MyGPIOG_TypeDef;

//typedef struct {
//} MyGPIOH_TypeDef;

//typedef struct {
//} MyGPIOI_TypeDef;

//typedef struct {
//} MyGPIOJ_TypeDef;

//typedef struct {
//} MyGPIOK_TypeDef;

typedef struct {
	__IO union {
			struct {
				uint32_t EN:1;
				uint32_t ABORT:1;
				uint32_t DMAEN:1;
				uint32_t TCEN:1;
				uint32_t SSHIFT:1;
				uint32_t RESERVED5:1;
				uint32_t DFM:1;
				uint32_t FSEL:1;
				uint32_t FTHRES:5;
				uint32_t RESERVED13:3;
				uint32_t TEIE:1;
				uint32_t TCIE:1;
				uint32_t FTIE:1;
				uint32_t SMIE:1;
				uint32_t TOIE:1;
				uint32_t RESERVED21:1;
				uint32_t APMS:1;
				uint32_t PMM:1;
				uint32_t PRESCALER:8;
			};
			uint32_t val;
		} CR;
	__IO union {
			struct {
				uint32_t CKMODE:1;
				uint32_t RESERVED1:7;
				uint32_t CSHT:3;
				uint32_t RESERVED11:5;
				uint32_t FSIZE:5;
				uint32_t RESERVED21:11;
			};
			uint32_t val;
		} DCR;
	__IO union {
			struct {
				uint32_t TEF:1;
				uint32_t TCF:1;
				uint32_t FTF:1;
				uint32_t SMF:1;
				uint32_t TOF:1;
				uint32_t BUSY:1;
				uint32_t RESERVED6:2;
				uint32_t FLEVEL:6;
				uint32_t RESERVED14:18;
			};
			uint32_t val;
		} SR;
	__IO union {
			struct {
				uint32_t CTEF:1;
				uint32_t CTCF:1;
				uint32_t RESERVED2:1;
				uint32_t CSMF:1;
				uint32_t CTOF:1;
				uint32_t RESERVED5:27;
			};
			uint32_t val;
		} FCR;
	__IO union {
			struct {
				uint32_t DL:32;
			};
			uint32_t val;
		} DLR;
	__IO union {
			struct {
				uint32_t INSTRUCTION:8;
				uint32_t IMODE:2;
				uint32_t ADMODE:2;
				uint32_t ADSIZE:2;
				uint32_t ABMODE:2;
				uint32_t ABSIZE:2;
				uint32_t DCYC:5;
				uint32_t RESERVED23:1;
				uint32_t DMODE:2;
				uint32_t FMODE:2;
				uint32_t SIOO:1;
				uint32_t RESERVED29:1;
				uint32_t DHHC:1;
				uint32_t DDRM:1;
			};
			uint32_t val;
		} CCR;
	__IO union {
			struct {
				uint32_t ADDRESS:32;
			};
			uint32_t val;
		} AR;
	__IO union {
			struct {
				uint32_t ALTERNATE:32;
			};
			uint32_t val;
		} ABR;
	__IO union {
			struct {
				uint32_t DATA:32;
			};
			uint32_t val;
		} DR;
	__IO union {
			struct {
				uint32_t MASK:32;
			};
			uint32_t val;
		} PSMKR;
	__IO union {
			struct {
				uint32_t MATCH:32;
			};
			uint32_t val;
		} PSMAR;
	__IO union {
			struct {
				uint32_t INTERVAL:16;
				uint32_t RESERVED16:16;
			};
			uint32_t val;
		} PIR;
	__IO union {
			struct {
				uint32_t TIMEOUT:16;
				uint32_t RESERVED16:16;
			};
			uint32_t val;
		} LPTR;
} MyQUADSPI_TypeDef;

