minichao9901/my_stm32_projects/stm32h750_simple_reg/CORE/stm32h750_typedefs.h
typedef struct {
	__IO union {
			struct {
				uint32_t LPDS:1;
				uint32_t RESERVED1:3;
				uint32_t PVDE:1;
				uint32_t PLS:3;
				uint32_t DBP:1;
				uint32_t FLPS:1;
				uint32_t RESERVED10:4;
				uint32_t SVOS:2;
				uint32_t AVDEN:1;
				uint32_t ALS:2;
				uint32_t RESERVED19:13;
			};
			uint32_t val;
		} CR1;
	__IO union {
			struct {
				uint32_t RESERVED0:4;
				uint32_t PVDO:1;
				uint32_t RESERVED5:8;
				uint32_t ACTVOSRDY:1;
				uint32_t ACTVOS:2;
				uint32_t AVDO:1;
				uint32_t RESERVED17:15;
			};
			uint32_t val;
		} CSR1;
	__IO union {
			struct {
				uint32_t BREN:1;
				uint32_t RESERVED1:3;
				uint32_t MONEN:1;
				uint32_t RESERVED5:11;
				uint32_t BRRDY:1;
				uint32_t RESERVED17:3;
				uint32_t VBATL:1;
				uint32_t VBATH:1;
				uint32_t TEMPL:1;
				uint32_t TEMPH:1;
				uint32_t RESERVED24:8;
			};
			uint32_t val;
		} CR2;
	__IO union {
			struct {
				uint32_t BYPASS:1;
				uint32_t LDOEN:1;
				uint32_t SDEN:1;
				uint32_t RESERVED3:5;
				uint32_t VBE:1;
				uint32_t VBRS:1;
				uint32_t RESERVED10:14;
				uint32_t USB33DEN:1;
				uint32_t USBREGEN:1;
				uint32_t USB33RDY:1;
				uint32_t RESERVED27:5;
			};
			uint32_t val;
		} CR3;
	__IO union {
			struct {
				uint32_t PDDS_D1:1;
				uint32_t PDDS_D2:1;
				uint32_t PDDS_D3:1;
				uint32_t RESERVED3:2;
				uint32_t STOPF:1;
				uint32_t SBF:1;
				uint32_t SBF_D1:1;
				uint32_t SBF_D2:1;
				uint32_t CSSF:1;
				uint32_t RESERVED10:1;
				uint32_t RUN_D3:1;
				uint32_t RESERVED12:20;
			};
			uint32_t val;
		} CPUCR;
	uint32_t RESERVED5;
	__IO union {
			struct {
				uint32_t RESERVED0:13;
				uint32_t VOSRDY:1;
				uint32_t VOS:2;
				uint32_t RESERVED16:16;
			};
			uint32_t val;
		} D3CR;
	uint32_t RESERVED7;
	__IO union {
			struct {
				uint32_t WKUPC:6;
				uint32_t RESERVED6:26;
			};
			uint32_t val;
		} WKUPCR;
	__IO union {
			struct {
				uint32_t WKUPF1:1;
				uint32_t WKUPF2:1;
				uint32_t WKUPF3:1;
				uint32_t WKUPF4:1;
				uint32_t WKUPF5:1;
				uint32_t WKUPF6:1;
				uint32_t RESERVED6:26;
			};
			uint32_t val;
		} WKUPFR;
	__IO union {
			struct {
				uint32_t WKUPEN1:1;
				uint32_t WKUPEN2:1;
				uint32_t WKUPEN3:1;
				uint32_t WKUPEN4:1;
				uint32_t WKUPEN5:1;
				uint32_t WKUPEN6:1;
				uint32_t RESERVED6:2;
				uint32_t WKUPP1:1;
				uint32_t WKUPP2:1;
				uint32_t WKUPP3:1;
				uint32_t WKUPP4:1;
				uint32_t WKUPP5:1;
				uint32_t WKUPP6:1;
				uint32_t RESERVED14:2;
				uint32_t WKUPPUPD1:2;
				uint32_t WKUPPUPD2:2;
				uint32_t WKUPPUPD3:2;
				uint32_t WKUPPUPD4:2;
				uint32_t WKUPPUPD5:2;
				uint32_t WKUPPUPD6:2;
				uint32_t RESERVED28:4;
			};
			uint32_t val;
		} WKUPEPR;
} MyPWR_TypeDef;

typedef struct {
	__IO union {
			struct {
				uint32_t SPE:1;
				uint32_t RESERVED1:7;
				uint32_t MASRX:1;
				uint32_t CSTART:1;
				uint32_t CSUSP:1;
				uint32_t HDDIR:1;
				uint32_t SSI:1;
				uint32_t CRC33_17:1;
				uint32_t RCRCI:1;
				uint32_t TCRCI:1;
				uint32_t IOLOCK:1;
				uint32_t RESERVED17:15;
			};
			uint32_t val;
		} CR1;
	__IO union {
			struct {
				uint32_t TSIZE:16;
				uint32_t TSER:16;
			};
			uint32_t val;
		} CR2;
	__IO union {
			struct {
				uint32_t DSIZE:5;
				uint32_t FTHVL:4;
				uint32_t UDRCFG:2;
				uint32_t UDRDET:2;
				uint32_t RESERVED13:1;
				uint32_t RXDMAEN:1;
				uint32_t TXDMAEN:1;
				uint32_t CRCSIZE:5;
				uint32_t RESERVED21:1;
				uint32_t CRCEN:1;
				uint32_t RESERVED23:5;
				uint32_t MBR:3;
				uint32_t RESERVED31:1;
			};
			uint32_t val;
		} CFG1;
	__IO union {
			struct {
				uint32_t MSSI:4;
				uint32_t MIDI:4;
				uint32_t RESERVED8:7;
				uint32_t IOSWP:1;
				uint32_t RESERVED16:1;
				uint32_t COMM:2;
				uint32_t SP:3;
				uint32_t MASTER:1;
				uint32_t LSBFRST:1;
				uint32_t CPHA:1;
				uint32_t CPOL:1;
				uint32_t SSM:1;
				uint32_t RESERVED27:1;
				uint32_t SSIOP:1;
				uint32_t SSOE:1;
				uint32_t SSOM:1;
				uint32_t AFCNTR:1;
			};
			uint32_t val;
		} CFG2;
	__IO union {
			struct {
				uint32_t RXPIE:1;
				uint32_t TXPIE:1;
				uint32_t DPXPIE:1;
				uint32_t EOTIE:1;
				uint32_t TXTFIE:1;
				uint32_t UDRIE:1;
				uint32_t OVRIE:1;
				uint32_t CRCEIE:1;
				uint32_t TIFREIE:1;
				uint32_t MODFIE:1;
				uint32_t TSERFIE:1;
				uint32_t RESERVED11:21;
			};
			uint32_t val;
		} IER;
	__IO union {
			struct {
				uint32_t RXP:1;
				uint32_t TXP:1;
				uint32_t DXP:1;
				uint32_t EOT:1;
				uint32_t TXTF:1;
				uint32_t UDR:1;
				uint32_t OVR:1;
				uint32_t CRCE:1;
				uint32_t TIFRE:1;
				uint32_t MODF:1;
				uint32_t TSERF:1;
				uint32_t SUSP:1;
				uint32_t TXC:1;
				uint32_t RXPLVL:2;
				uint32_t RXWNE:1;
				uint32_t CTSIZE:16;
			};
			uint32_t val;
		} SR;
	__IO union {
			struct {
				uint32_t RESERVED0:3;
				uint32_t EOTC:1;
				uint32_t TXTFC:1;
				uint32_t UDRC:1;
				uint32_t OVRC:1;
				uint32_t CRCEC:1;
				uint32_t TIFREC:1;
				uint32_t MODFC:1;
				uint32_t TSERFC:1;
				uint32_t SUSPC:1;
				uint32_t RESERVED12:20;
			};
			uint32_t val;
		} IFCR;
	uint32_t RESERVED7;
	__IO union {
			struct {
				uint32_t TXDR:32;
			};
			uint32_t val;
		} TXDR;
	uint32_t RESERVED9;
	uint32_t RESERVED10;
	uint32_t RESERVED11;
	__IO union {
			struct {
				uint32_t RXDR:32;
			};
			uint32_t val;
		} RXDR;
	uint32_t RESERVED13;
	uint32_t RESERVED14;
	uint32_t RESERVED15;
	__IO union {
			struct {
				uint32_t CRCPOLY:32;
			};
			uint32_t val;
		} CRCPOLY;
	__IO union {
			struct {
				uint32_t TXCRC:32;
			};
			uint32_t val;
		} TXCRC;
	__IO union {
			struct {
				uint32_t RXCRC:32;
			};
			uint32_t val;
		} RXCRC;
	__IO union {
			struct {
				uint32_t UDRDR:32;
			};
			uint32_t val;
		} UDRDR;
	__IO union {
			struct {
				uint32_t I2SMOD:1;
				uint32_t I2SCFG:3;
				uint32_t I2SSTD:2;
				uint32_t RESERVED6:1;
				uint32_t PCMSYNC:1;
				uint32_t DATLEN:2;
				uint32_t CHLEN:1;
				uint32_t CKPOL:1;
				uint32_t FIXCH:1;
				uint32_t WSINV:1;
				uint32_t DATFMT:1;
				uint32_t RESERVED15:1;
				uint32_t I2SDIV:8;
				uint32_t ODD:1;
				uint32_t MCKOE:1;
				uint32_t RESERVED26:6;
			};
			uint32_t val;
		} CGFR;
} MySPI1_TypeDef;

