minichao9901/my_stm32_projects/stm32h750_simple_reg/CORE/stm32h750_typedefs.h
typedef struct {
	uint32_t RESERVED0;
	uint32_t RESERVED1;
	__IO union {
			struct {
				uint32_t VSH:11;
				uint32_t RESERVED11:5;
				uint32_t HSW:10;
				uint32_t RESERVED26:6;
			};
			uint32_t val;
		} SSCR;
	__IO union {
			struct {
				uint32_t AVBP:11;
				uint32_t RESERVED11:5;
				uint32_t AHBP:12;
				uint32_t RESERVED28:4;
			};
			uint32_t val;
		} BPCR;
	__IO union {
			struct {
				uint32_t AAH:11;
				uint32_t RESERVED11:5;
				uint32_t AAV:12;
				uint32_t RESERVED28:4;
			};
			uint32_t val;
		} AWCR;
	__IO union {
			struct {
				uint32_t TOTALH:11;
				uint32_t RESERVED11:5;
				uint32_t TOTALW:12;
				uint32_t RESERVED28:4;
			};
			uint32_t val;
		} TWCR;
	__IO union {
			struct {
				uint32_t LTDCEN:1;
				uint32_t RESERVED1:3;
				uint32_t DBW:3;
				uint32_t RESERVED7:1;
				uint32_t DGW:3;
				uint32_t RESERVED11:1;
				uint32_t DRW:3;
				uint32_t RESERVED15:1;
				uint32_t DEN:1;
				uint32_t RESERVED17:11;
				uint32_t PCPOL:1;
				uint32_t DEPOL:1;
				uint32_t VSPOL:1;
				uint32_t HSPOL:1;
			};
			uint32_t val;
		} GCR;
	uint32_t RESERVED7;
	uint32_t RESERVED8;
	__IO union {
			struct {
				uint32_t IMR:1;
				uint32_t VBR:1;
				uint32_t RESERVED2:30;
			};
			uint32_t val;
		} SRCR;
	uint32_t RESERVED10;
	__IO union {
			struct {
				uint32_t BCBLUE:8;
				uint32_t BCGREEN:8;
				uint32_t BCRED:8;
				uint32_t RESERVED24:8;
			};
			uint32_t val;
		} BCCR;
	uint32_t RESERVED12;
	__IO union {
			struct {
				uint32_t LIE:1;
				uint32_t FUIE:1;
				uint32_t TERRIE:1;
				uint32_t RRIE:1;
				uint32_t RESERVED4:28;
			};
			uint32_t val;
		} IER;
	__IO union {
			struct {
				uint32_t LIF:1;
				uint32_t FUIF:1;
				uint32_t TERRIF:1;
				uint32_t RRIF:1;
				uint32_t RESERVED4:28;
			};
			uint32_t val;
		} ISR;
	__IO union {
			struct {
				uint32_t CLIF:1;
				uint32_t CFUIF:1;
				uint32_t CTERRIF:1;
				uint32_t CRRIF:1;
				uint32_t RESERVED4:28;
			};
			uint32_t val;
		} ICR;
	__IO union {
			struct {
				uint32_t LIPOS:11;
				uint32_t RESERVED11:21;
			};
			uint32_t val;
		} LIPCR;
	__IO union {
			struct {
				uint32_t CYPOS:16;
				uint32_t CXPOS:16;
			};
			uint32_t val;
		} CPSR;
	__IO union {
			struct {
				uint32_t VDES:1;
				uint32_t HDES:1;
				uint32_t VSYNCS:1;
				uint32_t HSYNCS:1;
				uint32_t RESERVED4:28;
			};
			uint32_t val;
		} CDSR;
	uint32_t RESERVED19;
	uint32_t RESERVED20;
	uint32_t RESERVED21;
	uint32_t RESERVED22;
	uint32_t RESERVED23;
	uint32_t RESERVED24;
	uint32_t RESERVED25;
	uint32_t RESERVED26;
	uint32_t RESERVED27;
	uint32_t RESERVED28;
	uint32_t RESERVED29;
	uint32_t RESERVED30;
	uint32_t RESERVED31;
	uint32_t RESERVED32;
	__IO union {
			struct {
				uint32_t LEN:1;
				uint32_t COLKEN:1;
				uint32_t RESERVED2:2;
				uint32_t CLUTEN:1;
				uint32_t RESERVED5:27;
			};
			uint32_t val;
		} L1CR;
	__IO union {
			struct {
				uint32_t WHSTPOS:12;
				uint32_t RESERVED12:4;
				uint32_t WHSPPOS:12;
				uint32_t RESERVED28:4;
			};
			uint32_t val;
		} L1WHPCR;
	__IO union {
			struct {
				uint32_t WVSTPOS:11;
				uint32_t RESERVED11:5;
				uint32_t WVSPPOS:11;
				uint32_t RESERVED27:5;
			};
			uint32_t val;
		} L1WVPCR;
	__IO union {
			struct {
				uint32_t CKBLUE:8;
				uint32_t CKGREEN:8;
				uint32_t CKRED:8;
				uint32_t RESERVED24:8;
			};
			uint32_t val;
		} L1CKCR;
	__IO union {
			struct {
				uint32_t PF:3;
				uint32_t RESERVED3:29;
			};
			uint32_t val;
		} L1PFCR;
	__IO union {
			struct {
				uint32_t CONSTA:8;
				uint32_t RESERVED8:24;
			};
			uint32_t val;
		} L1CACR;
	__IO union {
			struct {
				uint32_t DCBLUE:8;
				uint32_t DCGREEN:8;
				uint32_t DCRED:8;
				uint32_t DCALPHA:8;
			};
			uint32_t val;
		} L1DCCR;
	__IO union {
			struct {
				uint32_t BF2:3;
				uint32_t RESERVED3:5;
				uint32_t BF1:3;
				uint32_t RESERVED11:21;
			};
			uint32_t val;
		} L1BFCR;
	uint32_t RESERVED41;
	uint32_t RESERVED42;
	__IO union {
			struct {
				uint32_t CFBADD:32;
			};
			uint32_t val;
		} L1CFBAR;
	__IO union {
			struct {
				uint32_t CFBLL:13;
				uint32_t RESERVED13:3;
				uint32_t CFBP:13;
				uint32_t RESERVED29:3;
			};
			uint32_t val;
		} L1CFBLR;
	__IO union {
			struct {
				uint32_t CFBLNBR:11;
				uint32_t RESERVED11:21;
			};
			uint32_t val;
		} L1CFBLNR;
	uint32_t RESERVED46;
	uint32_t RESERVED47;
	uint32_t RESERVED48;
	__IO union {
			struct {
				uint32_t BLUE:8;
				uint32_t GREEN:8;
				uint32_t RED:8;
				uint32_t CLUTADD:8;
			};
			uint32_t val;
		} L1CLUTWR;
	uint32_t RESERVED50;
	uint32_t RESERVED51;
	uint32_t RESERVED52;
	uint32_t RESERVED53;
	uint32_t RESERVED54;
	uint32_t RESERVED55;
	uint32_t RESERVED56;
	uint32_t RESERVED57;
	uint32_t RESERVED58;
	uint32_t RESERVED59;
	uint32_t RESERVED60;
	uint32_t RESERVED61;
	uint32_t RESERVED62;
	uint32_t RESERVED63;
	uint32_t RESERVED64;
	__IO union {
			struct {
				uint32_t LEN:1;
				uint32_t COLKEN:1;
				uint32_t RESERVED2:2;
				uint32_t CLUTEN:1;
				uint32_t RESERVED5:27;
			};
			uint32_t val;
		} L2CR;
	__IO union {
			struct {
				uint32_t WHSTPOS:12;
				uint32_t RESERVED12:4;
				uint32_t WHSPPOS:12;
				uint32_t RESERVED28:4;
			};
			uint32_t val;
		} L2WHPCR;
	__IO union {
			struct {
				uint32_t WVSTPOS:11;
				uint32_t RESERVED11:5;
				uint32_t WVSPPOS:11;
				uint32_t RESERVED27:5;
			};
			uint32_t val;
		} L2WVPCR;
	__IO union {
			struct {
				uint32_t CKBLUE:8;
				uint32_t CKGREEN:8;
				uint32_t CKRED:8;
				uint32_t RESERVED24:8;
			};
			uint32_t val;
		} L2CKCR;
	__IO union {
			struct {
				uint32_t PF:3;
				uint32_t RESERVED3:29;
			};
			uint32_t val;
		} L2PFCR;
	__IO union {
			struct {
				uint32_t CONSTA:8;
				uint32_t RESERVED8:24;
			};
			uint32_t val;
		} L2CACR;
	__IO union {
			struct {
				uint32_t DCBLUE:8;
				uint32_t DCGREEN:8;
				uint32_t DCRED:8;
				uint32_t DCALPHA:8;
			};
			uint32_t val;
		} L2DCCR;
	__IO union {
			struct {
				uint32_t BF2:3;
				uint32_t RESERVED3:5;
				uint32_t BF1:3;
				uint32_t RESERVED11:21;
			};
			uint32_t val;
		} L2BFCR;
	uint32_t RESERVED73;
	uint32_t RESERVED74;
	__IO union {
			struct {
				uint32_t CFBADD:32;
			};
			uint32_t val;
		} L2CFBAR;
	__IO union {
			struct {
				uint32_t CFBLL:13;
				uint32_t RESERVED13:3;
				uint32_t CFBP:13;
				uint32_t RESERVED29:3;
			};
			uint32_t val;
		} L2CFBLR;
	__IO union {
			struct {
				uint32_t CFBLNBR:11;
				uint32_t RESERVED11:21;
			};
			uint32_t val;
		} L2CFBLNR;
	uint32_t RESERVED78;
	uint32_t RESERVED79;
	uint32_t RESERVED80;
	__IO union {
			struct {
				uint32_t BLUE:8;
				uint32_t GREEN:8;
				uint32_t RED:8;
				uint32_t CLUTADD:8;
			};
			uint32_t val;
		} L2CLUTWR;
} MyLTDC_TypeDef;

