minichao9901/my_stm32_projects/stm32h750_simple_reg/CORE/stm32h750_typedefs.h
typedef struct {
	__IO union {
			struct {
				uint32_t HSION:1;
				uint32_t HSIKERON:1;
				uint32_t HSIRDY:1;
				uint32_t HSIDIV:2;
				uint32_t HSIDIVF:1;
				uint32_t RESERVED6:1;
				uint32_t CSION:1;
				uint32_t CSIRDY:1;
				uint32_t CSIKERON:1;
				uint32_t RESERVED10:2;
				uint32_t RC48ON:1;
				uint32_t RC48RDY:1;
				uint32_t D1CKRDY:1;
				uint32_t D2CKRDY:1;
				uint32_t HSEON:1;
				uint32_t HSERDY:1;
				uint32_t HSEBYP:1;
				uint32_t HSECSSON:1;
				uint32_t RESERVED20:4;
				uint32_t PLL1ON:1;
				uint32_t PLL1RDY:1;
				uint32_t PLL2ON:1;
				uint32_t PLL2RDY:1;
				uint32_t PLL3ON:1;
				uint32_t PLL3RDY:1;
				uint32_t RESERVED30:2;
			};
			uint32_t val;
		} CR;
	__IO union {
			struct {
				uint32_t HSICAL:12;
				uint32_t HSITRIM:6;
				uint32_t CSICAL:8;
				uint32_t CSITRIM:5;
				uint32_t RESERVED31:1;
			};
			uint32_t val;
		} ICSCR;
	__IO union {
			struct {
				uint32_t RC48CAL:10;
				uint32_t RESERVED10:22;
			};
			uint32_t val;
		} CRRCR;
	uint32_t RESERVED3;
	__IO union {
			struct {
				uint32_t SW:3;
				uint32_t SWS:3;
				uint32_t STOPWUCK:1;
				uint32_t STOPKERWUCK:1;
				uint32_t RTCPRE:6;
				uint32_t HRTIMSEL:1;
				uint32_t TIMPRE:1;
				uint32_t RESERVED16:2;
				uint32_t MCO1PRE:4;
				uint32_t MCO1SEL:3;
				uint32_t MCO2PRE:4;
				uint32_t MCO2SEL:3;
			};
			uint32_t val;
		} CFGR;
	uint32_t RESERVED5;
	__IO union {
			struct {
				uint32_t HPRE:4;
				uint32_t D1PPRE:3;
				uint32_t RESERVED7:1;
				uint32_t D1CPRE:4;
				uint32_t RESERVED12:20;
			};
			uint32_t val;
		} D1CFGR;
	__IO union {
			struct {
				uint32_t RESERVED0:4;
				uint32_t D2PPRE1:3;
				uint32_t RESERVED7:1;
				uint32_t D2PPRE2:3;
				uint32_t RESERVED11:21;
			};
			uint32_t val;
		} D2CFGR;
	__IO union {
			struct {
				uint32_t RESERVED0:4;
				uint32_t D3PPRE:3;
				uint32_t RESERVED7:25;
			};
			uint32_t val;
		} D3CFGR;
	uint32_t RESERVED9;
	__IO union {
			struct {
				uint32_t PLLSRC:2;
				uint32_t RESERVED2:2;
				uint32_t DIVM1:6;
				uint32_t RESERVED10:2;
				uint32_t DIVM2:6;
				uint32_t RESERVED18:2;
				uint32_t DIVM3:6;
				uint32_t RESERVED26:6;
			};
			uint32_t val;
		} PLLCKSELR;
	__IO union {
			struct {
				uint32_t PLL1FRACEN:1;
				uint32_t PLL1VCOSEL:1;
				uint32_t PLL1RGE:2;
				uint32_t PLL2FRACEN:1;
				uint32_t PLL2VCOSEL:1;
				uint32_t PLL2RGE:2;
				uint32_t PLL3FRACEN:1;
				uint32_t PLL3VCOSEL:1;
				uint32_t PLL3RGE:2;
				uint32_t RESERVED12:4;
				uint32_t DIVP1EN:1;
				uint32_t DIVQ1EN:1;
				uint32_t DIVR1EN:1;
				uint32_t DIVP2EN:1;
				uint32_t DIVQ2EN:1;
				uint32_t DIVR2EN:1;
				uint32_t DIVP3EN:1;
				uint32_t DIVQ3EN:1;
				uint32_t DIVR3EN:1;
				uint32_t RESERVED25:7;
			};
			uint32_t val;
		} PLLCFGR;
	__IO union {
			struct {
				uint32_t DIVN1:9;
				uint32_t DIVP1:7;
				uint32_t DIVQ1:7;
				uint32_t RESERVED23:1;
				uint32_t DIVR1:7;
				uint32_t RESERVED31:1;
			};
			uint32_t val;
		} PLL1DIVR;
	__IO union {
			struct {
				uint32_t RESERVED0:3;
				uint32_t FRACN1:13;
				uint32_t RESERVED16:16;
			};
			uint32_t val;
		} PLL1FRACR;
	__IO union {
			struct {
				uint32_t DIVN2:9;
				uint32_t DIVP2:7;
				uint32_t DIVQ2:7;
				uint32_t RESERVED23:1;
				uint32_t DIVR2:7;
				uint32_t RESERVED31:1;
			};
			uint32_t val;
		} PLL2DIVR;
	__IO union {
			struct {
				uint32_t RESERVED0:3;
				uint32_t FRACN2:13;
				uint32_t RESERVED16:16;
			};
			uint32_t val;
		} PLL2FRACR;
	__IO union {
			struct {
				uint32_t DIVN3:9;
				uint32_t DIVP3:7;
				uint32_t DIVQ3:7;
				uint32_t RESERVED23:1;
				uint32_t DIVR3:7;
				uint32_t RESERVED31:1;
			};
			uint32_t val;
		} PLL3DIVR;
	__IO union {
			struct {
				uint32_t RESERVED0:3;
				uint32_t FRACN3:13;
				uint32_t RESERVED16:16;
			};
			uint32_t val;
		} PLL3FRACR;
	uint32_t RESERVED18;
	__IO union {
			struct {
				uint32_t FMCSRC:2;
				uint32_t RESERVED2:2;
				uint32_t QSPISRC:2;
				uint32_t RESERVED6:10;
				uint32_t SDMMCSRC:1;
				uint32_t RESERVED17:11;
				uint32_t CKPERSRC:2;
				uint32_t RESERVED30:2;
			};
			uint32_t val;
		} D1CCIPR;
	__IO union {
			struct {
				uint32_t SAI1SRC:3;
				uint32_t RESERVED3:3;
				uint32_t SAI23SRC:3;
				uint32_t RESERVED9:3;
				uint32_t SPI123SRC:3;
				uint32_t RESERVED15:1;
				uint32_t SPI45SRC:3;
				uint32_t RESERVED19:1;
				uint32_t SPDIFSRC:2;
				uint32_t RESERVED22:2;
				uint32_t DFSDM1SRC:1;
				uint32_t RESERVED25:3;
				uint32_t FDCANSRC:2;
				uint32_t RESERVED30:1;
				uint32_t SWPSRC:1;
			};
			uint32_t val;
		} D2CCIP1R;
	__IO union {
			struct {
				uint32_t USART234578SRC:3;
				uint32_t USART16SRC:3;
				uint32_t RESERVED6:2;
				uint32_t RNGSRC:2;
				uint32_t RESERVED10:2;
				uint32_t I2C123SRC:2;
				uint32_t RESERVED14:6;
				uint32_t USBSRC:2;
				uint32_t CECSRC:2;
				uint32_t RESERVED24:4;
				uint32_t LPTIM1SRC:3;
				uint32_t RESERVED31:1;
			};
			uint32_t val;
		} D2CCIP2R;
	__IO union {
			struct {
				uint32_t LPUART1SRC:3;
				uint32_t RESERVED3:5;
				uint32_t I2C4SRC:2;
				uint32_t LPTIM2SRC:3;
				uint32_t LPTIM345SRC:3;
				uint32_t ADCSRC:2;
				uint32_t RESERVED18:3;
				uint32_t SAI4ASRC:3;
				uint32_t SAI4BSRC:3;
				uint32_t RESERVED27:1;
				uint32_t SPI6SRC:3;
				uint32_t RESERVED31:1;
			};
			uint32_t val;
		} D3CCIPR;
	uint32_t RESERVED23;
	__IO union {
			struct {
				uint32_t LSIRDYIE:1;
				uint32_t LSERDYIE:1;
				uint32_t HSIRDYIE:1;
				uint32_t HSERDYIE:1;
				uint32_t CSIRDYIE:1;
				uint32_t RC48RDYIE:1;
				uint32_t PLL1RDYIE:1;
				uint32_t PLL2RDYIE:1;
				uint32_t PLL3RDYIE:1;
				uint32_t LSECSSIE:1;
				uint32_t RESERVED10:22;
			};
			uint32_t val;
		} CIER;
	__IO union {
			struct {
				uint32_t LSIRDYF:1;
				uint32_t LSERDYF:1;
				uint32_t HSIRDYF:1;
				uint32_t HSERDYF:1;
				uint32_t CSIRDY:1;
				uint32_t RC48RDYF:1;
				uint32_t PLL1RDYF:1;
				uint32_t PLL2RDYF:1;
				uint32_t PLL3RDYF:1;
				uint32_t LSECSSF:1;
				uint32_t HSECSSF:1;
				uint32_t RESERVED11:21;
			};
			uint32_t val;
		} CIFR;
	__IO union {
			struct {
				uint32_t LSIRDYC:1;
				uint32_t LSERDYC:1;
				uint32_t HSIRDYC:1;
				uint32_t HSERDYC:1;
				uint32_t HSE_ready_Interrupt_Clear:1;
				uint32_t RC48RDYC:1;
				uint32_t PLL1RDYC:1;
				uint32_t PLL2RDYC:1;
				uint32_t PLL3RDYC:1;
				uint32_t LSECSSC:1;
				uint32_t HSECSSC:1;
				uint32_t RESERVED11:21;
			};
			uint32_t val;
		} CICR;
	uint32_t RESERVED27;
	__IO union {
			struct {
				uint32_t LSEON:1;
				uint32_t LSERDY:1;
				uint32_t LSEBYP:1;
				uint32_t LSEDRV:2;
				uint32_t LSECSSON:1;
				uint32_t LSECSSD:1;
				uint32_t RESERVED7:1;
				uint32_t RTCSRC:2;
				uint32_t RESERVED10:5;
				uint32_t RTCEN:1;
				uint32_t VSWRST:1;
				uint32_t RESERVED17:15;
			};
			uint32_t val;
		} BDCR;
	__IO union {
			struct {
				uint32_t LSION:1;
				uint32_t LSIRDY:1;
				uint32_t RESERVED2:30;
			};
			uint32_t val;
		} CSR;
	uint32_t RESERVED30;
	__IO union {
			struct {
				uint32_t MDMARST:1;
				uint32_t RESERVED1:3;
				uint32_t DMA2DRST:1;
				uint32_t JPGDECRST:1;
				uint32_t RESERVED6:6;
				uint32_t FMCRST:1;
				uint32_t RESERVED13:1;
				uint32_t QSPIRST:1;
				uint32_t RESERVED15:1;
				uint32_t SDMMC1RST:1;
				uint32_t RESERVED17:14;
				uint32_t CPURST:1;
			};
			uint32_t val;
		} AHB3RSTR;
	__IO union {
			struct {
				uint32_t DMA1RST:1;
				uint32_t DMA2RST:1;
				uint32_t RESERVED2:3;
				uint32_t ADC12RST:1;
				uint32_t RESERVED6:9;
				uint32_t ETH1MACRST:1;
				uint32_t RESERVED16:9;
				uint32_t USB1OTGRST:1;
				uint32_t RESERVED26:1;
				uint32_t USB2OTGRST:1;
				uint32_t RESERVED28:4;
			};
			uint32_t val;
		} AHB1RSTR;
	__IO union {
			struct {
				uint32_t CAMITFRST:1;
				uint32_t RESERVED1:3;
				uint32_t CRYPTRST:1;
				uint32_t HASHRST:1;
				uint32_t RNGRST:1;
				uint32_t RESERVED7:2;
				uint32_t SDMMC2RST:1;
				uint32_t RESERVED10:22;
			};
			uint32_t val;
		} AHB2RSTR;
	__IO union {
			struct {
				uint32_t GPIOARST:1;
				uint32_t GPIOBRST:1;
				uint32_t GPIOCRST:1;
				uint32_t GPIODRST:1;
				uint32_t GPIOERST:1;
				uint32_t GPIOFRST:1;
				uint32_t GPIOGRST:1;
				uint32_t GPIOHRST:1;
				uint32_t GPIOIRST:1;
				uint32_t GPIOJRST:1;
				uint32_t GPIOKRST:1;
				uint32_t RESERVED11:8;
				uint32_t CRCRST:1;
				uint32_t RESERVED20:1;
				uint32_t BDMARST:1;
				uint32_t RESERVED22:2;
				uint32_t ADC3RST:1;
				uint32_t HSEMRST:1;
				uint32_t RESERVED26:6;
			};
			uint32_t val;
		} AHB4RSTR;
	__IO union {
			struct {
				uint32_t RESERVED0:3;
				uint32_t LTDCRST:1;
				uint32_t RESERVED4:28;
			};
			uint32_t val;
		} APB3RSTR;
	__IO union {
			struct {
				uint32_t TIM2RST:1;
				uint32_t TIM3RST:1;
				uint32_t TIM4RST:1;
				uint32_t TIM5RST:1;
				uint32_t TIM6RST:1;
				uint32_t TIM7RST:1;
				uint32_t TIM12RST:1;
				uint32_t TIM13RST:1;
				uint32_t TIM14RST:1;
				uint32_t LPTIM1RST:1;
				uint32_t RESERVED10:4;
				uint32_t SPI2RST:1;
				uint32_t SPI3RST:1;
				uint32_t SPDIFRXRST:1;
				uint32_t USART2RST:1;
				uint32_t USART3RST:1;
				uint32_t UART4RST:1;
				uint32_t UART5RST:1;
				uint32_t I2C1RST:1;
				uint32_t I2C2RST:1;
				uint32_t I2C3RST:1;
				uint32_t RESERVED24:3;
				uint32_t HDMICECRST:1;
				uint32_t RESERVED28:1;
				uint32_t DAC12RST:1;
				uint32_t USART7RST:1;
				uint32_t USART8RST:1;
			};
			uint32_t val;
		} APB1LRSTR;
	__IO union {
			struct {
				uint32_t RESERVED0:1;
				uint32_t CRSRST:1;
				uint32_t SWPRST:1;
				uint32_t RESERVED3:1;
				uint32_t OPAMPRST:1;
				uint32_t MDIOSRST:1;
				uint32_t RESERVED6:2;
				uint32_t FDCANRST:1;
				uint32_t RESERVED9:23;
			};
			uint32_t val;
		} APB1HRSTR;
	__IO union {
			struct {
				uint32_t TIM1RST:1;
				uint32_t TIM8RST:1;
				uint32_t RESERVED2:2;
				uint32_t USART1RST:1;
				uint32_t USART6RST:1;
				uint32_t RESERVED6:6;
				uint32_t SPI1RST:1;
				uint32_t SPI4RST:1;
				uint32_t RESERVED14:2;
				uint32_t TIM15RST:1;
				uint32_t TIM16RST:1;
				uint32_t TIM17RST:1;
				uint32_t RESERVED19:1;
				uint32_t SPI5RST:1;
				uint32_t RESERVED21:1;
				uint32_t SAI1RST:1;
				uint32_t SAI2RST:1;
				uint32_t SAI3RST:1;
				uint32_t RESERVED25:3;
				uint32_t DFSDM1RST:1;
				uint32_t HRTIMRST:1;
				uint32_t RESERVED30:2;
			};
			uint32_t val;
		} APB2RSTR;
	__IO union {
			struct {
				uint32_t RESERVED0:1;
				uint32_t SYSCFGRST:1;
				uint32_t RESERVED2:1;
				uint32_t LPUART1RST:1;
				uint32_t RESERVED4:1;
				uint32_t SPI6RST:1;
				uint32_t RESERVED6:1;
				uint32_t I2C4RST:1;
				uint32_t RESERVED8:1;
				uint32_t LPTIM2RST:1;
				uint32_t LPTIM3RST:1;
				uint32_t LPTIM4RST:1;
				uint32_t LPTIM5RST:1;
				uint32_t RESERVED13:1;
				uint32_t COMP12RST:1;
				uint32_t VREFRST:1;
				uint32_t RESERVED16:5;
				uint32_t SAI4RST:1;
				uint32_t RESERVED22:10;
			};
			uint32_t val;
		} APB4RSTR;
	__IO union {
			struct {
				uint32_t WW1RSC:1;
				uint32_t RESERVED1:31;
			};
			uint32_t val;
		} GCR;
	uint32_t RESERVED41;
	__IO union {
			struct {
				uint32_t BDMAAMEN:1;
				uint32_t RESERVED1:2;
				uint32_t LPUART1AMEN:1;
				uint32_t RESERVED4:1;
				uint32_t SPI6AMEN:1;
				uint32_t RESERVED6:1;
				uint32_t I2C4AMEN:1;
				uint32_t RESERVED8:1;
				uint32_t LPTIM2AMEN:1;
				uint32_t LPTIM3AMEN:1;
				uint32_t LPTIM4AMEN:1;
				uint32_t LPTIM5AMEN:1;
				uint32_t RESERVED13:1;
				uint32_t COMP12AMEN:1;
				uint32_t VREFAMEN:1;
				uint32_t RTCAMEN:1;
				uint32_t RESERVED17:2;
				uint32_t CRCAMEN:1;
				uint32_t RESERVED20:1;
				uint32_t SAI4AMEN:1;
				uint32_t RESERVED22:2;
				uint32_t ADC3AMEN:1;
				uint32_t RESERVED25:3;
				uint32_t BKPSRAMAMEN:1;
				uint32_t SRAM4AMEN:1;
				uint32_t RESERVED30:2;
			};
			uint32_t val;
		} D3AMR;
	uint32_t RESERVED43;
	uint32_t RESERVED44;
	uint32_t RESERVED45;
	uint32_t RESERVED46;
	uint32_t RESERVED47;
	uint32_t RESERVED48;
	uint32_t RESERVED49;
	uint32_t RESERVED50;
	uint32_t RESERVED51;
	__IO union {
			struct {
				uint32_t RESERVED0:16;
				uint32_t RMVF:1;
				uint32_t CPURSTF:1;
				uint32_t RESERVED18:1;
				uint32_t D1RSTF:1;
				uint32_t D2RSTF:1;
				uint32_t BORRSTF:1;
				uint32_t PINRSTF:1;
				uint32_t PORRSTF:1;
				uint32_t SFTRSTF:1;
				uint32_t RESERVED25:1;
				uint32_t IWDG1RSTF:1;
				uint32_t RESERVED27:1;
				uint32_t WWDG1RSTF:1;
				uint32_t RESERVED29:1;
				uint32_t LPWRRSTF:1;
				uint32_t RESERVED31:1;
			};
			uint32_t val;
		} RSR;
	__IO union {
			struct {
				uint32_t MDMAEN:1;
				uint32_t RESERVED1:3;
				uint32_t DMA2DEN:1;
				uint32_t JPGDECEN:1;
				uint32_t RESERVED6:6;
				uint32_t FMCEN:1;
				uint32_t RESERVED13:1;
				uint32_t QSPIEN:1;
				uint32_t RESERVED15:1;
				uint32_t SDMMC1EN:1;
				uint32_t RESERVED17:15;
			};
			uint32_t val;
		} AHB3ENR;
	__IO union {
			struct {
				uint32_t DMA1EN:1;
				uint32_t DMA2EN:1;
				uint32_t RESERVED2:3;
				uint32_t ADC12EN:1;
				uint32_t RESERVED6:9;
				uint32_t ETH1MACEN:1;
				uint32_t ETH1TXEN:1;
				uint32_t ETH1RXEN:1;
				uint32_t RESERVED18:7;
				uint32_t USB1OTGEN:1;
				uint32_t USB1ULPIEN:1;
				uint32_t USB2OTGEN:1;
				uint32_t USB2ULPIEN:1;
				uint32_t RESERVED29:3;
			};
			uint32_t val;
		} AHB1ENR;
	__IO union {
			struct {
				uint32_t CAMITFEN:1;
				uint32_t RESERVED1:3;
				uint32_t CRYPTEN:1;
				uint32_t HASHEN:1;
				uint32_t RNGEN:1;
				uint32_t RESERVED7:2;
				uint32_t SDMMC2EN:1;
				uint32_t RESERVED10:19;
				uint32_t SRAM1EN:1;
				uint32_t SRAM2EN:1;
				uint32_t SRAM3EN:1;
			};
			uint32_t val;
		} AHB2ENR;
	__IO union {
			struct {
				uint32_t GPIOAEN:1;
				uint32_t GPIOBEN:1;
				uint32_t GPIOCEN:1;
				uint32_t GPIODEN:1;
				uint32_t GPIOEEN:1;
				uint32_t GPIOFEN:1;
				uint32_t GPIOGEN:1;
				uint32_t GPIOHEN:1;
				uint32_t GPIOIEN:1;
				uint32_t GPIOJEN:1;
				uint32_t GPIOKEN:1;
				uint32_t RESERVED11:8;
				uint32_t CRCEN:1;
				uint32_t RESERVED20:1;
				uint32_t BDMAEN:1;
				uint32_t RESERVED22:2;
				uint32_t ADC3EN:1;
				uint32_t HSEMEN:1;
				uint32_t RESERVED26:2;
				uint32_t BKPRAMEN:1;
				uint32_t RESERVED29:3;
			};
			uint32_t val;
		} AHB4ENR;
	__IO union {
			struct {
				uint32_t RESERVED0:3;
				uint32_t LTDCEN:1;
				uint32_t RESERVED4:2;
				uint32_t WWDG1EN:1;
				uint32_t RESERVED7:25;
			};
			uint32_t val;
		} APB3ENR;
	__IO union {
			struct {
				uint32_t TIM2EN:1;
				uint32_t TIM3EN:1;
				uint32_t TIM4EN:1;
				uint32_t TIM5EN:1;
				uint32_t TIM6EN:1;
				uint32_t TIM7EN:1;
				uint32_t TIM12EN:1;
				uint32_t TIM13EN:1;
				uint32_t TIM14EN:1;
				uint32_t LPTIM1EN:1;
				uint32_t RESERVED10:4;
				uint32_t SPI2EN:1;
				uint32_t SPI3EN:1;
				uint32_t SPDIFRXEN:1;
				uint32_t USART2EN:1;
				uint32_t USART3EN:1;
				uint32_t UART4EN:1;
				uint32_t UART5EN:1;
				uint32_t I2C1EN:1;
				uint32_t I2C2EN:1;
				uint32_t I2C3EN:1;
				uint32_t RESERVED24:3;
				uint32_t HDMICECEN:1;
				uint32_t RESERVED28:1;
				uint32_t DAC12EN:1;
				uint32_t USART7EN:1;
				uint32_t USART8EN:1;
			};
			uint32_t val;
		} APB1LENR;
	__IO union {
			struct {
				uint32_t RESERVED0:1;
				uint32_t CRSEN:1;
				uint32_t SWPEN:1;
				uint32_t RESERVED3:1;
				uint32_t OPAMPEN:1;
				uint32_t MDIOSEN:1;
				uint32_t RESERVED6:2;
				uint32_t FDCANEN:1;
				uint32_t RESERVED9:23;
			};
			uint32_t val;
		} APB1HENR;
	__IO union {
			struct {
				uint32_t TIM1EN:1;
				uint32_t TIM8EN:1;
				uint32_t RESERVED2:2;
				uint32_t USART1EN:1;
				uint32_t USART6EN:1;
				uint32_t RESERVED6:6;
				uint32_t SPI1EN:1;
				uint32_t SPI4EN:1;
				uint32_t RESERVED14:2;
				uint32_t TIM15EN:1;
				uint32_t TIM16EN:1;
				uint32_t TIM17EN:1;
				uint32_t RESERVED19:1;
				uint32_t SPI5EN:1;
				uint32_t RESERVED21:1;
				uint32_t SAI1EN:1;
				uint32_t SAI2EN:1;
				uint32_t SAI3EN:1;
				uint32_t RESERVED25:3;
				uint32_t DFSDM1EN:1;
				uint32_t HRTIMEN:1;
				uint32_t RESERVED30:2;
			};
			uint32_t val;
		} APB2ENR;
	__IO union {
			struct {
				uint32_t RESERVED0:1;
				uint32_t SYSCFGEN:1;
				uint32_t RESERVED2:1;
				uint32_t LPUART1EN:1;
				uint32_t RESERVED4:1;
				uint32_t SPI6EN:1;
				uint32_t RESERVED6:1;
				uint32_t I2C4EN:1;
				uint32_t RESERVED8:1;
				uint32_t LPTIM2EN:1;
				uint32_t LPTIM3EN:1;
				uint32_t LPTIM4EN:1;
				uint32_t LPTIM5EN:1;
				uint32_t RESERVED13:1;
				uint32_t COMP12EN:1;
				uint32_t VREFEN:1;
				uint32_t RTCAPBEN:1;
				uint32_t RESERVED17:4;
				uint32_t SAI4EN:1;
				uint32_t RESERVED22:10;
			};
			uint32_t val;
		} APB4ENR;
	uint32_t RESERVED62;
	__IO union {
			struct {
				uint32_t MDMALPEN:1;
				uint32_t RESERVED1:3;
				uint32_t DMA2DLPEN:1;
				uint32_t JPGDECLPEN:1;
				uint32_t RESERVED6:2;
				uint32_t FLITFLPEN:1;
				uint32_t RESERVED9:3;
				uint32_t FMCLPEN:1;
				uint32_t RESERVED13:1;
				uint32_t QSPILPEN:1;
				uint32_t RESERVED15:1;
				uint32_t SDMMC1LPEN:1;
				uint32_t RESERVED17:11;
				uint32_t D1DTCM1LPEN:1;
				uint32_t DTCM2LPEN:1;
				uint32_t ITCMLPEN:1;
				uint32_t AXISRAMLPEN:1;
			};
			uint32_t val;
		} AHB3LPENR;
	__IO union {
			struct {
				uint32_t DMA1LPEN:1;
				uint32_t DMA2LPEN:1;
				uint32_t RESERVED2:3;
				uint32_t ADC12LPEN:1;
				uint32_t RESERVED6:9;
				uint32_t ETH1MACLPEN:1;
				uint32_t ETH1TXLPEN:1;
				uint32_t ETH1RXLPEN:1;
				uint32_t RESERVED18:7;
				uint32_t USB1OTGLPEN:1;
				uint32_t USB1ULPILPEN:1;
				uint32_t USB2OTGLPEN:1;
				uint32_t USB2ULPILPEN:1;
				uint32_t RESERVED29:3;
			};
			uint32_t val;
		} AHB1LPENR;
	__IO union {
			struct {
				uint32_t CAMITFLPEN:1;
				uint32_t RESERVED1:3;
				uint32_t CRYPTLPEN:1;
				uint32_t HASHLPEN:1;
				uint32_t RNGLPEN:1;
				uint32_t RESERVED7:2;
				uint32_t SDMMC2LPEN:1;
				uint32_t RESERVED10:19;
				uint32_t SRAM1LPEN:1;
				uint32_t SRAM2LPEN:1;
				uint32_t SRAM3LPEN:1;
			};
			uint32_t val;
		} AHB2LPENR;
	__IO union {
			struct {
				uint32_t GPIOALPEN:1;
				uint32_t GPIOBLPEN:1;
				uint32_t GPIOCLPEN:1;
				uint32_t GPIODLPEN:1;
				uint32_t GPIOELPEN:1;
				uint32_t GPIOFLPEN:1;
				uint32_t GPIOGLPEN:1;
				uint32_t GPIOHLPEN:1;
				uint32_t GPIOILPEN:1;
				uint32_t GPIOJLPEN:1;
				uint32_t GPIOKLPEN:1;
				uint32_t RESERVED11:8;
				uint32_t CRCLPEN:1;
				uint32_t RESERVED20:1;
				uint32_t BDMALPEN:1;
				uint32_t RESERVED22:2;
				uint32_t ADC3LPEN:1;
				uint32_t RESERVED25:3;
				uint32_t BKPRAMLPEN:1;
				uint32_t SRAM4LPEN:1;
				uint32_t RESERVED30:2;
			};
			uint32_t val;
		} AHB4LPENR;
	__IO union {
			struct {
				uint32_t RESERVED0:3;
				uint32_t LTDCLPEN:1;
				uint32_t RESERVED4:2;
				uint32_t WWDG1LPEN:1;
				uint32_t RESERVED7:25;
			};
			uint32_t val;
		} APB3LPENR;
	__IO union {
			struct {
				uint32_t TIM2LPEN:1;
				uint32_t TIM3LPEN:1;
				uint32_t TIM4LPEN:1;
				uint32_t TIM5LPEN:1;
				uint32_t TIM6LPEN:1;
				uint32_t TIM7LPEN:1;
				uint32_t TIM12LPEN:1;
				uint32_t TIM13LPEN:1;
				uint32_t TIM14LPEN:1;
				uint32_t LPTIM1LPEN:1;
				uint32_t RESERVED10:4;
				uint32_t SPI2LPEN:1;
				uint32_t SPI3LPEN:1;
				uint32_t SPDIFRXLPEN:1;
				uint32_t USART2LPEN:1;
				uint32_t USART3LPEN:1;
				uint32_t UART4LPEN:1;
				uint32_t UART5LPEN:1;
				uint32_t I2C1LPEN:1;
				uint32_t I2C2LPEN:1;
				uint32_t I2C3LPEN:1;
				uint32_t RESERVED24:3;
				uint32_t HDMICECLPEN:1;
				uint32_t RESERVED28:1;
				uint32_t DAC12LPEN:1;
				uint32_t USART7LPEN:1;
				uint32_t USART8LPEN:1;
			};
			uint32_t val;
		} APB1LLPENR;
	__IO union {
			struct {
				uint32_t RESERVED0:1;
				uint32_t CRSLPEN:1;
				uint32_t SWPLPEN:1;
				uint32_t RESERVED3:1;
				uint32_t OPAMPLPEN:1;
				uint32_t MDIOSLPEN:1;
				uint32_t RESERVED6:2;
				uint32_t FDCANLPEN:1;
				uint32_t RESERVED9:23;
			};
			uint32_t val;
		} APB1HLPENR;
	__IO union {
			struct {
				uint32_t TIM1LPEN:1;
				uint32_t TIM8LPEN:1;
				uint32_t RESERVED2:2;
				uint32_t USART1LPEN:1;
				uint32_t USART6LPEN:1;
				uint32_t RESERVED6:6;
				uint32_t SPI1LPEN:1;
				uint32_t SPI4LPEN:1;
				uint32_t RESERVED14:2;
				uint32_t TIM15LPEN:1;
				uint32_t TIM16LPEN:1;
				uint32_t TIM17LPEN:1;
				uint32_t RESERVED19:1;
				uint32_t SPI5LPEN:1;
				uint32_t RESERVED21:1;
				uint32_t SAI1LPEN:1;
				uint32_t SAI2LPEN:1;
				uint32_t SAI3LPEN:1;
				uint32_t RESERVED25:3;
				uint32_t DFSDM1LPEN:1;
				uint32_t HRTIMLPEN:1;
				uint32_t RESERVED30:2;
			};
			uint32_t val;
		} APB2LPENR;
	__IO union {
			struct {
				uint32_t RESERVED0:1;
				uint32_t SYSCFGLPEN:1;
				uint32_t RESERVED2:1;
				uint32_t LPUART1LPEN:1;
				uint32_t RESERVED4:1;
				uint32_t SPI6LPEN:1;
				uint32_t RESERVED6:1;
				uint32_t I2C4LPEN:1;
				uint32_t RESERVED8:1;
				uint32_t LPTIM2LPEN:1;
				uint32_t LPTIM3LPEN:1;
				uint32_t LPTIM4LPEN:1;
				uint32_t LPTIM5LPEN:1;
				uint32_t RESERVED13:1;
				uint32_t COMP12LPEN:1;
				uint32_t VREFLPEN:1;
				uint32_t RTCAPBLPEN:1;
				uint32_t RESERVED17:4;
				uint32_t SAI4LPEN:1;
				uint32_t RESERVED22:10;
			};
			uint32_t val;
		} APB4LPENR;
	uint32_t RESERVED72;
	uint32_t RESERVED73;
	uint32_t RESERVED74;
	uint32_t RESERVED75;
	__IO union {
			struct {
				uint32_t RESERVED0:16;
				uint32_t RMVF:1;
				uint32_t CPURSTF:1;
				uint32_t RESERVED18:1;
				uint32_t D1RSTF:1;
				uint32_t D2RSTF:1;
				uint32_t BORRSTF:1;
				uint32_t PINRSTF:1;
				uint32_t PORRSTF:1;
				uint32_t SFTRSTF:1;
				uint32_t RESERVED25:1;
				uint32_t IWDG1RSTF:1;
				uint32_t RESERVED27:1;
				uint32_t WWDG1RSTF:1;
				uint32_t RESERVED29:1;
				uint32_t LPWRRSTF:1;
				uint32_t RESERVED31:1;
			};
			uint32_t val;
		} C1_RSR;
	__IO union {
			struct {
				uint32_t MDMAEN:1;
				uint32_t RESERVED1:3;
				uint32_t DMA2DEN:1;
				uint32_t JPGDECEN:1;
				uint32_t RESERVED6:6;
				uint32_t FMCEN:1;
				uint32_t RESERVED13:1;
				uint32_t QSPIEN:1;
				uint32_t RESERVED15:1;
				uint32_t SDMMC1EN:1;
				uint32_t RESERVED17:15;
			};
			uint32_t val;
		} C1_AHB3ENR;
	__IO union {
			struct {
				uint32_t DMA1EN:1;
				uint32_t DMA2EN:1;
				uint32_t RESERVED2:3;
				uint32_t ADC12EN:1;
				uint32_t RESERVED6:9;
				uint32_t ETH1MACEN:1;
				uint32_t ETH1TXEN:1;
				uint32_t ETH1RXEN:1;
				uint32_t RESERVED18:7;
				uint32_t USB1OTGEN:1;
				uint32_t USB1ULPIEN:1;
				uint32_t USB2OTGEN:1;
				uint32_t USB2ULPIEN:1;
				uint32_t RESERVED29:3;
			};
			uint32_t val;
		} C1_AHB1ENR;
	__IO union {
			struct {
				uint32_t CAMITFEN:1;
				uint32_t RESERVED1:3;
				uint32_t CRYPTEN:1;
				uint32_t HASHEN:1;
				uint32_t RNGEN:1;
				uint32_t RESERVED7:2;
				uint32_t SDMMC2EN:1;
				uint32_t RESERVED10:19;
				uint32_t SRAM1EN:1;
				uint32_t SRAM2EN:1;
				uint32_t SRAM3EN:1;
			};
			uint32_t val;
		} C1_AHB2ENR;
	__IO union {
			struct {
				uint32_t GPIOAEN:1;
				uint32_t GPIOBEN:1;
				uint32_t GPIOCEN:1;
				uint32_t GPIODEN:1;
				uint32_t GPIOEEN:1;
				uint32_t GPIOFEN:1;
				uint32_t GPIOGEN:1;
				uint32_t GPIOHEN:1;
				uint32_t GPIOIEN:1;
				uint32_t GPIOJEN:1;
				uint32_t GPIOKEN:1;
				uint32_t RESERVED11:8;
				uint32_t CRCEN:1;
				uint32_t RESERVED20:1;
				uint32_t BDMAEN:1;
				uint32_t RESERVED22:2;
				uint32_t ADC3EN:1;
				uint32_t HSEMEN:1;
				uint32_t RESERVED26:2;
				uint32_t BKPRAMEN:1;
				uint32_t RESERVED29:3;
			};
			uint32_t val;
		} C1_AHB4ENR;
	__IO union {
			struct {
				uint32_t RESERVED0:3;
				uint32_t LTDCEN:1;
				uint32_t RESERVED4:2;
				uint32_t WWDG1EN:1;
				uint32_t RESERVED7:25;
			};
			uint32_t val;
		} C1_APB3ENR;
	__IO union {
			struct {
				uint32_t TIM2EN:1;
				uint32_t TIM3EN:1;
				uint32_t TIM4EN:1;
				uint32_t TIM5EN:1;
				uint32_t TIM6EN:1;
				uint32_t TIM7EN:1;
				uint32_t TIM12EN:1;
				uint32_t TIM13EN:1;
				uint32_t TIM14EN:1;
				uint32_t LPTIM1EN:1;
				uint32_t RESERVED10:4;
				uint32_t SPI2EN:1;
				uint32_t SPI3EN:1;
				uint32_t SPDIFRXEN:1;
				uint32_t USART2EN:1;
				uint32_t USART3EN:1;
				uint32_t UART4EN:1;
				uint32_t UART5EN:1;
				uint32_t I2C1EN:1;
				uint32_t I2C2EN:1;
				uint32_t I2C3EN:1;
				uint32_t RESERVED24:3;
				uint32_t HDMICECEN:1;
				uint32_t RESERVED28:1;
				uint32_t DAC12EN:1;
				uint32_t USART7EN:1;
				uint32_t USART8EN:1;
			};
			uint32_t val;
		} C1_APB1LENR;
	__IO union {
			struct {
				uint32_t RESERVED0:1;
				uint32_t CRSEN:1;
