minichao9901/my_stm32_projects/stm32h750_simple_reg/CORE/stm32h750_typedefs.h
				uint32_t SWPEN:1;
				uint32_t RESERVED3:1;
				uint32_t OPAMPEN:1;
				uint32_t MDIOSEN:1;
				uint32_t RESERVED6:2;
				uint32_t FDCANEN:1;
				uint32_t RESERVED9:23;
			};
			uint32_t val;
		} C1_APB1HENR;
	__IO union {
			struct {
				uint32_t TIM1EN:1;
				uint32_t TIM8EN:1;
				uint32_t RESERVED2:2;
				uint32_t USART1EN:1;
				uint32_t USART6EN:1;
				uint32_t RESERVED6:6;
				uint32_t SPI1EN:1;
				uint32_t SPI4EN:1;
				uint32_t RESERVED14:2;
				uint32_t TIM15EN:1;
				uint32_t TIM16EN:1;
				uint32_t TIM17EN:1;
				uint32_t RESERVED19:1;
				uint32_t SPI5EN:1;
				uint32_t RESERVED21:1;
				uint32_t SAI1EN:1;
				uint32_t SAI2EN:1;
				uint32_t SAI3EN:1;
				uint32_t RESERVED25:3;
				uint32_t DFSDM1EN:1;
				uint32_t HRTIMEN:1;
				uint32_t RESERVED30:2;
			};
			uint32_t val;
		} C1_APB2ENR;
	__IO union {
			struct {
				uint32_t RESERVED0:1;
				uint32_t SYSCFGEN:1;
				uint32_t RESERVED2:1;
				uint32_t LPUART1EN:1;
				uint32_t RESERVED4:1;
				uint32_t SPI6EN:1;
				uint32_t RESERVED6:1;
				uint32_t I2C4EN:1;
				uint32_t RESERVED8:1;
				uint32_t LPTIM2EN:1;
				uint32_t LPTIM3EN:1;
				uint32_t LPTIM4EN:1;
				uint32_t LPTIM5EN:1;
				uint32_t RESERVED13:1;
				uint32_t COMP12EN:1;
				uint32_t VREFEN:1;
				uint32_t RTCAPBEN:1;
				uint32_t RESERVED17:4;
				uint32_t SAI4EN:1;
				uint32_t RESERVED22:10;
			};
			uint32_t val;
		} C1_APB4ENR;
	uint32_t RESERVED86;
	__IO union {
			struct {
				uint32_t MDMALPEN:1;
				uint32_t RESERVED1:3;
				uint32_t DMA2DLPEN:1;
				uint32_t JPGDECLPEN:1;
				uint32_t RESERVED6:2;
				uint32_t FLITFLPEN:1;
				uint32_t RESERVED9:3;
				uint32_t FMCLPEN:1;
				uint32_t RESERVED13:1;
				uint32_t QSPILPEN:1;
				uint32_t RESERVED15:1;
				uint32_t SDMMC1LPEN:1;
				uint32_t RESERVED17:11;
				uint32_t D1DTCM1LPEN:1;
				uint32_t DTCM2LPEN:1;
				uint32_t ITCMLPEN:1;
				uint32_t AXISRAMLPEN:1;
			};
			uint32_t val;
		} C1_AHB3LPENR;
	__IO union {
			struct {
				uint32_t DMA1LPEN:1;
				uint32_t DMA2LPEN:1;
				uint32_t RESERVED2:3;
				uint32_t ADC12LPEN:1;
				uint32_t RESERVED6:9;
				uint32_t ETH1MACLPEN:1;
				uint32_t ETH1TXLPEN:1;
				uint32_t ETH1RXLPEN:1;
				uint32_t RESERVED18:7;
				uint32_t USB1OTGLPEN:1;
				uint32_t USB1ULPILPEN:1;
				uint32_t USB2OTGLPEN:1;
				uint32_t USB2ULPILPEN:1;
				uint32_t RESERVED29:3;
			};
			uint32_t val;
		} C1_AHB1LPENR;
	__IO union {
			struct {
				uint32_t CAMITFLPEN:1;
				uint32_t RESERVED1:3;
				uint32_t CRYPTLPEN:1;
				uint32_t HASHLPEN:1;
				uint32_t RNGLPEN:1;
				uint32_t RESERVED7:2;
				uint32_t SDMMC2LPEN:1;
				uint32_t RESERVED10:19;
				uint32_t SRAM1LPEN:1;
				uint32_t SRAM2LPEN:1;
				uint32_t SRAM3LPEN:1;
			};
			uint32_t val;
		} C1_AHB2LPENR;
	__IO union {
			struct {
				uint32_t GPIOALPEN:1;
				uint32_t GPIOBLPEN:1;
				uint32_t GPIOCLPEN:1;
				uint32_t GPIODLPEN:1;
				uint32_t GPIOELPEN:1;
				uint32_t GPIOFLPEN:1;
				uint32_t GPIOGLPEN:1;
				uint32_t GPIOHLPEN:1;
				uint32_t GPIOILPEN:1;
				uint32_t GPIOJLPEN:1;
				uint32_t GPIOKLPEN:1;
				uint32_t RESERVED11:8;
				uint32_t CRCLPEN:1;
				uint32_t RESERVED20:1;
				uint32_t BDMALPEN:1;
				uint32_t RESERVED22:2;
				uint32_t ADC3LPEN:1;
				uint32_t RESERVED25:3;
				uint32_t BKPRAMLPEN:1;
				uint32_t SRAM4LPEN:1;
				uint32_t RESERVED30:2;
			};
			uint32_t val;
		} C1_AHB4LPENR;
	__IO union {
			struct {
				uint32_t RESERVED0:3;
				uint32_t LTDCLPEN:1;
				uint32_t RESERVED4:2;
				uint32_t WWDG1LPEN:1;
				uint32_t RESERVED7:25;
			};
			uint32_t val;
		} C1_APB3LPENR;
	__IO union {
			struct {
				uint32_t TIM2LPEN:1;
				uint32_t TIM3LPEN:1;
				uint32_t TIM4LPEN:1;
				uint32_t TIM5LPEN:1;
				uint32_t TIM6LPEN:1;
				uint32_t TIM7LPEN:1;
				uint32_t TIM12LPEN:1;
				uint32_t TIM13LPEN:1;
				uint32_t TIM14LPEN:1;
				uint32_t LPTIM1LPEN:1;
				uint32_t RESERVED10:4;
				uint32_t SPI2LPEN:1;
				uint32_t SPI3LPEN:1;
				uint32_t SPDIFRXLPEN:1;
				uint32_t USART2LPEN:1;
				uint32_t USART3LPEN:1;
				uint32_t UART4LPEN:1;
				uint32_t UART5LPEN:1;
				uint32_t I2C1LPEN:1;
				uint32_t I2C2LPEN:1;
				uint32_t I2C3LPEN:1;
				uint32_t RESERVED24:3;
				uint32_t HDMICECLPEN:1;
				uint32_t RESERVED28:1;
				uint32_t DAC12LPEN:1;
				uint32_t USART7LPEN:1;
				uint32_t USART8LPEN:1;
			};
			uint32_t val;
		} C1_APB1LLPENR;
	__IO union {
			struct {
				uint32_t RESERVED0:1;
				uint32_t CRSLPEN:1;
				uint32_t SWPLPEN:1;
				uint32_t RESERVED3:1;
				uint32_t OPAMPLPEN:1;
				uint32_t MDIOSLPEN:1;
				uint32_t RESERVED6:2;
				uint32_t FDCANLPEN:1;
				uint32_t RESERVED9:23;
			};
			uint32_t val;
		} C1_APB1HLPENR;
	__IO union {
			struct {
				uint32_t TIM1LPEN:1;
				uint32_t TIM8LPEN:1;
				uint32_t RESERVED2:2;
				uint32_t USART1LPEN:1;
				uint32_t USART6LPEN:1;
				uint32_t RESERVED6:6;
				uint32_t SPI1LPEN:1;
				uint32_t SPI4LPEN:1;
				uint32_t RESERVED14:2;
				uint32_t TIM15LPEN:1;
				uint32_t TIM16LPEN:1;
				uint32_t TIM17LPEN:1;
				uint32_t RESERVED19:1;
				uint32_t SPI5LPEN:1;
				uint32_t RESERVED21:1;
				uint32_t SAI1LPEN:1;
				uint32_t SAI2LPEN:1;
				uint32_t SAI3LPEN:1;
				uint32_t RESERVED25:3;
				uint32_t DFSDM1LPEN:1;
				uint32_t HRTIMLPEN:1;
				uint32_t RESERVED30:2;
			};
			uint32_t val;
		} C1_APB2LPENR;
	__IO union {
			struct {
				uint32_t RESERVED0:1;
				uint32_t SYSCFGLPEN:1;
				uint32_t RESERVED2:1;
				uint32_t LPUART1LPEN:1;
				uint32_t RESERVED4:1;
				uint32_t SPI6LPEN:1;
				uint32_t RESERVED6:1;
				uint32_t I2C4LPEN:1;
				uint32_t RESERVED8:1;
				uint32_t LPTIM2LPEN:1;
				uint32_t LPTIM3LPEN:1;
				uint32_t LPTIM4LPEN:1;
				uint32_t LPTIM5LPEN:1;
				uint32_t RESERVED13:1;
				uint32_t COMP12LPEN:1;
				uint32_t VREFLPEN:1;
				uint32_t RTCAPBLPEN:1;
				uint32_t RESERVED17:4;
				uint32_t SAI4LPEN:1;
				uint32_t RESERVED22:10;
			};
			uint32_t val;
		} C1_APB4LPENR;
} MyRCC_TypeDef;

typedef struct {
	__IO union {
			struct {
				uint32_t TR0:1;
				uint32_t TR1:1;
				uint32_t TR2:1;
				uint32_t TR3:1;
				uint32_t TR4:1;
				uint32_t TR5:1;
				uint32_t TR6:1;
				uint32_t TR7:1;
				uint32_t TR8:1;
				uint32_t TR9:1;
				uint32_t TR10:1;
				uint32_t TR11:1;
				uint32_t TR12:1;
				uint32_t TR13:1;
				uint32_t TR14:1;
				uint32_t TR15:1;
				uint32_t TR16:1;
				uint32_t TR17:1;
				uint32_t TR18:1;
				uint32_t TR19:1;
				uint32_t TR20:1;
				uint32_t TR21:1;
				uint32_t RESERVED22:10;
			};
			uint32_t val;
		} RTSR1;
	__IO union {
			struct {
				uint32_t TR0:1;
				uint32_t TR1:1;
				uint32_t TR2:1;
				uint32_t TR3:1;
				uint32_t TR4:1;
				uint32_t TR5:1;
				uint32_t TR6:1;
				uint32_t TR7:1;
				uint32_t TR8:1;
				uint32_t TR9:1;
				uint32_t TR10:1;
				uint32_t TR11:1;
				uint32_t TR12:1;
				uint32_t TR13:1;
				uint32_t TR14:1;
				uint32_t TR15:1;
				uint32_t TR16:1;
				uint32_t TR17:1;
				uint32_t TR18:1;
				uint32_t TR19:1;
				uint32_t TR20:1;
				uint32_t TR21:1;
				uint32_t RESERVED22:10;
			};
			uint32_t val;
		} FTSR1;
	__IO union {
			struct {
				uint32_t SWIER0:1;
				uint32_t SWIER1:1;
				uint32_t SWIER2:1;
				uint32_t SWIER3:1;
				uint32_t SWIER4:1;
				uint32_t SWIER5:1;
				uint32_t SWIER6:1;
				uint32_t SWIER7:1;
				uint32_t SWIER8:1;
				uint32_t SWIER9:1;
				uint32_t SWIER10:1;
				uint32_t SWIER11:1;
				uint32_t SWIER12:1;
				uint32_t SWIER13:1;
				uint32_t SWIER14:1;
				uint32_t SWIER15:1;
				uint32_t SWIER16:1;
				uint32_t SWIER17:1;
				uint32_t SWIER18:1;
				uint32_t SWIER19:1;
				uint32_t SWIER20:1;
				uint32_t SWIER21:1;
				uint32_t RESERVED22:10;
			};
			uint32_t val;
		} SWIER1;
	__IO union {
			struct {
				uint32_t MR0:1;
				uint32_t MR1:1;
				uint32_t MR2:1;
				uint32_t MR3:1;
				uint32_t MR4:1;
				uint32_t MR5:1;
				uint32_t MR6:1;
				uint32_t MR7:1;
				uint32_t MR8:1;
				uint32_t MR9:1;
				uint32_t MR10:1;
				uint32_t MR11:1;
				uint32_t MR12:1;
				uint32_t MR13:1;
				uint32_t MR14:1;
				uint32_t MR15:1;
				uint32_t RESERVED16:3;
				uint32_t MR19:1;
				uint32_t MR20:1;
				uint32_t MR21:1;
				uint32_t RESERVED22:3;
				uint32_t MR25:1;
				uint32_t RESERVED26:6;
			};
			uint32_t val;
		} D3PMR1;
	__IO union {
			struct {
				uint32_t PCS0:2;
				uint32_t PCS1:2;
				uint32_t PCS2:2;
				uint32_t PCS3:2;
				uint32_t PCS4:2;
				uint32_t PCS5:2;
				uint32_t PCS6:2;
				uint32_t PCS7:2;
				uint32_t PCS8:2;
				uint32_t PCS9:2;
				uint32_t PCS10:2;
				uint32_t PCS11:2;
				uint32_t PCS12:2;
				uint32_t PCS13:2;
				uint32_t PCS14:2;
				uint32_t PCS15:2;
			};
			uint32_t val;
		} D3PCR1L;
	__IO union {
			struct {
				uint32_t RESERVED0:6;
				uint32_t PCS19:2;
				uint32_t PCS20:2;
				uint32_t PCS21:2;
				uint32_t RESERVED12:6;
				uint32_t PCS25:2;
				uint32_t RESERVED20:12;
			};
			uint32_t val;
		} D3PCR1H;
	uint32_t RESERVED6;
	uint32_t RESERVED7;
	__IO union {
			struct {
				uint32_t RESERVED0:17;
				uint32_t TR49:1;
				uint32_t RESERVED18:1;
				uint32_t TR51:1;
				uint32_t RESERVED20:12;
			};
			uint32_t val;
		} RTSR2;
	__IO union {
			struct {
				uint32_t RESERVED0:17;
				uint32_t TR49:1;
				uint32_t RESERVED18:1;
				uint32_t TR51:1;
				uint32_t RESERVED20:12;
			};
			uint32_t val;
		} FTSR2;
	__IO union {
			struct {
				uint32_t RESERVED0:17;
				uint32_t SWIER49:1;
				uint32_t RESERVED18:1;
				uint32_t SWIER51:1;
				uint32_t RESERVED20:12;
			};
			uint32_t val;
		} SWIER2;
	__IO union {
			struct {
				uint32_t RESERVED0:2;
				uint32_t MR34:1;
				uint32_t MR35:1;
				uint32_t RESERVED4:5;
				uint32_t MR41:1;
				uint32_t RESERVED10:6;
				uint32_t MR48:1;
				uint32_t MR49:1;
				uint32_t MR50:1;
				uint32_t MR51:1;
				uint32_t MR52:1;
				uint32_t MR53:1;
				uint32_t RESERVED22:10;
			};
			uint32_t val;
		} D3PMR2;
	__IO union {
			struct {
				uint32_t RESERVED0:4;
				uint32_t PCS34:2;
				uint32_t PCS35:2;
				uint32_t RESERVED8:10;
				uint32_t PCS41:2;
				uint32_t RESERVED20:12;
			};
			uint32_t val;
		} D3PCR2L;
	__IO union {
			struct {
				uint32_t PCS48:2;
				uint32_t PCS49:2;
				uint32_t PCS50:2;
				uint32_t PCS51:2;
				uint32_t PCS52:2;
				uint32_t PCS53:2;
				uint32_t RESERVED12:20;
			};
			uint32_t val;
		} D3PCR2H;
	uint32_t RESERVED14;
	uint32_t RESERVED15;
	__IO union {
			struct {
				uint32_t RESERVED0:18;
				uint32_t TR82:1;
				uint32_t RESERVED19:1;
				uint32_t TR84:1;
				uint32_t TR85:1;
				uint32_t TR86:1;
				uint32_t RESERVED23:9;
			};
			uint32_t val;
		} RTSR3;
	__IO union {
			struct {
				uint32_t RESERVED0:18;
				uint32_t TR82:1;
				uint32_t RESERVED19:1;
				uint32_t TR84:1;
				uint32_t TR85:1;
				uint32_t TR86:1;
				uint32_t RESERVED23:9;
			};
			uint32_t val;
		} FTSR3;
	__IO union {
			struct {
				uint32_t RESERVED0:18;
				uint32_t SWIER82:1;
				uint32_t RESERVED19:1;
				uint32_t SWIER84:1;
				uint32_t SWIER85:1;
				uint32_t SWIER86:1;
				uint32_t RESERVED23:9;
			};
			uint32_t val;
		} SWIER3;
	__IO union {
			struct {
				uint32_t RESERVED0:24;
				uint32_t MR88:1;
				uint32_t RESERVED25:7;
			};
			uint32_t val;
		} D3PMR3;
	uint32_t RESERVED20;
	__IO union {
			struct {
				uint32_t RESERVED0:18;
				uint32_t PCS88:2;
				uint32_t RESERVED20:12;
			};
			uint32_t val;
		} D3PCR3H;
	uint32_t RESERVED22;
	uint32_t RESERVED23;
	uint32_t RESERVED24;
	uint32_t RESERVED25;
	uint32_t RESERVED26;
	uint32_t RESERVED27;
	uint32_t RESERVED28;
	uint32_t RESERVED29;
	uint32_t RESERVED30;
	uint32_t RESERVED31;
	__IO union {
			struct {
				uint32_t MR0:1;
				uint32_t MR1:1;
				uint32_t MR2:1;
				uint32_t MR3:1;
				uint32_t MR4:1;
				uint32_t MR5:1;
				uint32_t MR6:1;
				uint32_t MR7:1;
				uint32_t MR8:1;
				uint32_t MR9:1;
				uint32_t MR10:1;
				uint32_t MR11:1;
				uint32_t MR12:1;
				uint32_t MR13:1;
				uint32_t MR14:1;
				uint32_t MR15:1;
				uint32_t MR16:1;
				uint32_t MR17:1;
				uint32_t MR18:1;
				uint32_t MR19:1;
				uint32_t MR20:1;
				uint32_t MR21:1;
				uint32_t MR22:1;
				uint32_t MR23:1;
				uint32_t MR24:1;
				uint32_t MR25:1;
				uint32_t MR26:1;
				uint32_t MR27:1;
				uint32_t MR28:1;
				uint32_t MR29:1;
				uint32_t MR30:1;
				uint32_t MR31:1;
			};
			uint32_t val;
		} CPUIMR1;
	__IO union {
			struct {
				uint32_t MR0:1;
				uint32_t MR1:1;
				uint32_t MR2:1;
				uint32_t MR3:1;
				uint32_t MR4:1;
				uint32_t MR5:1;
				uint32_t MR6:1;
				uint32_t MR7:1;
				uint32_t MR8:1;
				uint32_t MR9:1;
				uint32_t MR10:1;
				uint32_t MR11:1;
				uint32_t MR12:1;
				uint32_t MR13:1;
				uint32_t MR14:1;
				uint32_t MR15:1;
				uint32_t MR16:1;
				uint32_t MR17:1;
				uint32_t MR18:1;
				uint32_t MR19:1;
				uint32_t MR20:1;
				uint32_t MR21:1;
				uint32_t MR22:1;
				uint32_t MR23:1;
				uint32_t MR24:1;
				uint32_t MR25:1;
				uint32_t MR26:1;
				uint32_t MR27:1;
				uint32_t MR28:1;
				uint32_t MR29:1;
				uint32_t MR30:1;
				uint32_t MR31:1;
			};
			uint32_t val;
		} CPUEMR1;
	__IO union {
			struct {
				uint32_t PR0:1;
				uint32_t PR1:1;
				uint32_t PR2:1;
				uint32_t PR3:1;
				uint32_t PR4:1;
				uint32_t PR5:1;
				uint32_t PR6:1;
				uint32_t PR7:1;
				uint32_t PR8:1;
				uint32_t PR9:1;
				uint32_t PR10:1;
				uint32_t PR11:1;
				uint32_t PR12:1;
				uint32_t PR13:1;
				uint32_t PR14:1;
				uint32_t PR15:1;
				uint32_t PR16:1;
				uint32_t PR17:1;
				uint32_t PR18:1;
				uint32_t PR19:1;
				uint32_t PR20:1;
				uint32_t PR21:1;
				uint32_t RESERVED22:10;
			};
			uint32_t val;
		} CPUPR1;
	uint32_t RESERVED35;
	__IO union {
			struct {
				uint32_t MR0:1;
				uint32_t MR1:1;
				uint32_t MR2:1;
				uint32_t MR3:1;
				uint32_t MR4:1;
				uint32_t MR5:1;
				uint32_t MR6:1;
				uint32_t MR7:1;
				uint32_t MR8:1;
				uint32_t MR9:1;
				uint32_t MR10:1;
				uint32_t MR11:1;
				uint32_t MR12:1;
				uint32_t RESERVED13:1;
				uint32_t MR14:1;
				uint32_t MR15:1;
				uint32_t MR16:1;
				uint32_t MR17:1;
				uint32_t MR18:1;
				uint32_t MR19:1;
				uint32_t MR20:1;
				uint32_t MR21:1;
				uint32_t MR22:1;
				uint32_t MR23:1;
				uint32_t MR24:1;
				uint32_t MR25:1;
				uint32_t MR26:1;
				uint32_t MR27:1;
				uint32_t MR28:1;
				uint32_t MR29:1;
				uint32_t MR30:1;
				uint32_t MR31:1;
			};
			uint32_t val;
		} CPUIMR2;
	__IO union {
			struct {
				uint32_t MR32:1;
				uint32_t MR33:1;
				uint32_t MR34:1;
				uint32_t MR35:1;
				uint32_t MR36:1;
				uint32_t MR37:1;
				uint32_t MR38:1;
				uint32_t MR39:1;
				uint32_t MR40:1;
				uint32_t MR41:1;
				uint32_t MR42:1;
				uint32_t MR43:1;
				uint32_t MR44:1;
				uint32_t RESERVED13:1;
				uint32_t MR46:1;
				uint32_t MR47:1;
				uint32_t MR48:1;
				uint32_t MR49:1;
				uint32_t MR50:1;
				uint32_t MR51:1;
				uint32_t MR52:1;
				uint32_t MR53:1;
				uint32_t MR54:1;
				uint32_t MR55:1;
				uint32_t MR56:1;
				uint32_t MR57:1;
				uint32_t MR58:1;
				uint32_t MR59:1;
				uint32_t MR60:1;
				uint32_t MR61:1;
				uint32_t MR62:1;
				uint32_t MR63:1;
			};
			uint32_t val;
		} CPUEMR2;
	__IO union {
			struct {
				uint32_t RESERVED0:17;
				uint32_t PR49:1;
				uint32_t RESERVED18:1;
				uint32_t PR51:1;
				uint32_t RESERVED20:12;
			};
			uint32_t val;
		} CPUPR2;
	uint32_t RESERVED39;
	__IO union {
			struct {
				uint32_t MR64:1;
				uint32_t MR65:1;
				uint32_t MR66:1;
				uint32_t MR67:1;
				uint32_t MR68:1;
				uint32_t MR69:1;
				uint32_t MR70:1;
				uint32_t MR71:1;
				uint32_t MR72:1;
				uint32_t MR73:1;
				uint32_t MR74:1;
				uint32_t MR75:1;
				uint32_t MR76:1;
				uint32_t MR77:1;
				uint32_t MR78:1;
				uint32_t MR79:1;
				uint32_t MR80:1;
				uint32_t RESERVED17:1;
				uint32_t MR82:1;
				uint32_t RESERVED19:1;
				uint32_t MR84:1;
				uint32_t MR85:1;
				uint32_t MR86:1;
				uint32_t MR87:1;
				uint32_t MR88:1;
				uint32_t RESERVED25:7;
			};
			uint32_t val;
		} CPUIMR3;
	__IO union {
			struct {
				uint32_t MR64:1;
				uint32_t MR65:1;
				uint32_t MR66:1;
				uint32_t MR67:1;
				uint32_t MR68:1;
				uint32_t MR69:1;
				uint32_t MR70:1;
				uint32_t MR71:1;
				uint32_t MR72:1;
				uint32_t MR73:1;
				uint32_t MR74:1;
				uint32_t MR75:1;
				uint32_t MR76:1;
				uint32_t MR77:1;
				uint32_t MR78:1;
				uint32_t MR79:1;
				uint32_t MR80:1;
				uint32_t RESERVED17:1;
				uint32_t MR82:1;
				uint32_t RESERVED19:1;
				uint32_t MR84:1;
				uint32_t MR85:1;
				uint32_t MR86:1;
				uint32_t MR87:1;
				uint32_t MR88:1;
				uint32_t RESERVED25:7;
			};
			uint32_t val;
		} CPUEMR3;
	__IO union {
			struct {
				uint32_t RESERVED0:18;
				uint32_t PR82:1;
				uint32_t RESERVED19:1;
				uint32_t PR84:1;
				uint32_t PR85:1;
				uint32_t PR86:1;
				uint32_t RESERVED23:9;
			};
			uint32_t val;
		} CPUPR3;
} MyEXTI_TypeDef;

