minichao9901/my_stm32_projects/stm32h750_simple_reg/CORE/stm32h750_typedefs.h
typedef struct {
	__IO union {
			struct {
				uint32_t LATENCY:4;
				uint32_t WRHIGHFREQ:2;
				uint32_t RESERVED6:26;
			};
			uint32_t val;
		} ACR;
	__IO union {
			struct {
				uint32_t KEY1R:32;
			};
			uint32_t val;
		} KEYR1;
	__IO union {
			struct {
				uint32_t OPTKEYR:32;
			};
			uint32_t val;
		} OPTKEYR;
	__IO union {
			struct {
				uint32_t LOCK1:1;
				uint32_t PG1:1;
				uint32_t SER1:1;
				uint32_t BER1:1;
				uint32_t PSIZE1:2;
				uint32_t FW1:1;
				uint32_t START1:1;
				uint32_t SNB1:3;
				uint32_t RESERVED11:4;
				uint32_t CRC_EN:1;
				uint32_t EOPIE1:1;
				uint32_t WRPERRIE1:1;
				uint32_t PGSERRIE1:1;
				uint32_t STRBERRIE1:1;
				uint32_t RESERVED20:1;
				uint32_t INCERRIE1:1;
				uint32_t OPERRIE1:1;
				uint32_t RDPERRIE1:1;
				uint32_t RDSERRIE1:1;
				uint32_t SNECCERR1:1;
				uint32_t DBECCERRIE1:1;
				uint32_t CRCENDIE1:1;
				uint32_t CRCRDERRIE1:1;
				uint32_t RESERVED29:3;
			};
			uint32_t val;
		} CR1;
	__IO union {
			struct {
				uint32_t BSY1:1;
				uint32_t WBNE1:1;
				uint32_t QW1:1;
				uint32_t CRC_BUSY1:1;
				uint32_t RESERVED4:12;
				uint32_t EOP1:1;
				uint32_t WRPERR1:1;
				uint32_t PGSERR1:1;
				uint32_t STRBERR1:1;
				uint32_t RESERVED20:1;
				uint32_t INCERR1:1;
				uint32_t OPERR1:1;
				uint32_t RDPERR1:1;
				uint32_t RDSERR1:1;
				uint32_t SNECCERR:1;
				uint32_t DBECCERR1:1;
				uint32_t CRCEND1:1;
				uint32_t CRCRDERR1:1;
				uint32_t RESERVED29:3;
			};
			uint32_t val;
		} SR1;
	__IO union {
			struct {
				uint32_t RESERVED0:16;
				uint32_t CLR_EOP1:1;
				uint32_t CLR_WRPERR1:1;
				uint32_t CLR_PGSERR1:1;
				uint32_t CLR_STRBERR1:1;
				uint32_t RESERVED20:1;
				uint32_t CLR_INCERR1:1;
				uint32_t CLR_OPERR1:1;
				uint32_t CLR_RDPERR1:1;
				uint32_t CLR_RDSERR1:1;
				uint32_t CLR_SNECCERR1:1;
				uint32_t CLR_DBECCERR1:1;
				uint32_t CLR_CRCEND1:1;
				uint32_t CLR_CRCRDERR1:1;
				uint32_t RESERVED29:3;
			};
			uint32_t val;
		} CCR1;
	__IO union {
			struct {
				uint32_t OPTLOCK:1;
				uint32_t OPTSTART:1;
				uint32_t RESERVED2:2;
				uint32_t MER:1;
				uint32_t RESERVED5:25;
				uint32_t OPTCHANGEERRIE:1;
				uint32_t SWAP_BANK:1;
			};
			uint32_t val;
		} OPTCR;
	__IO union {
			struct {
				uint32_t OPT_BUSY:1;
				uint32_t RESERVED1:1;
				uint32_t BOR_LEV:2;
				uint32_t IWDG1_SW:1;
				uint32_t RESERVED5:1;
				uint32_t NRST_STOP_D1:1;
				uint32_t NRST_STBY_D1:1;
				uint32_t RDP:8;
				uint32_t RESERVED16:1;
				uint32_t IWDG_FZ_STOP:1;
				uint32_t IWDG_FZ_SDBY:1;
				uint32_t ST_RAM_SIZE:2;
				uint32_t SECURITY:1;
				uint32_t RESERVED22:7;
				uint32_t IO_HSLV:1;
				uint32_t OPTCHANGEERR:1;
				uint32_t SWAP_BANK_OPT:1;
			};
			uint32_t val;
		} OPTSR_CUR;
	__IO union {
			struct {
				uint32_t RESERVED0:2;
				uint32_t BOR_LEV:2;
				uint32_t IWDG1_SW:1;
				uint32_t RESERVED5:1;
				uint32_t NRST_STOP_D1:1;
				uint32_t NRST_STBY_D1:1;
				uint32_t RDP:8;
				uint32_t RESERVED16:1;
				uint32_t IWDG_FZ_STOP:1;
				uint32_t IWDG_FZ_SDBY:1;
				uint32_t ST_RAM_SIZE:2;
				uint32_t SECURITY:1;
				uint32_t RESERVED22:7;
				uint32_t IO_HSLV:1;
				uint32_t RESERVED30:1;
				uint32_t SWAP_BANK_OPT:1;
			};
			uint32_t val;
		} OPTSR_PRG;
	__IO union {
			struct {
				uint32_t RESERVED0:30;
				uint32_t CLR_OPTCHANGEERR:1;
				uint32_t RESERVED31:1;
			};
			uint32_t val;
		} OPTCCR;
	__IO union {
			struct {
				uint32_t PROT_AREA_START1:12;
				uint32_t RESERVED12:4;
				uint32_t PROT_AREA_END1:12;
				uint32_t RESERVED28:3;
				uint32_t DMEP1:1;
			};
			uint32_t val;
		} PRAR_CUR1;
	__IO union {
			struct {
				uint32_t PROT_AREA_START1:12;
				uint32_t RESERVED12:4;
				uint32_t PROT_AREA_END1:12;
				uint32_t RESERVED28:3;
				uint32_t DMEP1:1;
			};
			uint32_t val;
		} PRAR_PRG1;
	__IO union {
			struct {
				uint32_t SEC_AREA_START1:12;
				uint32_t RESERVED12:4;
				uint32_t SEC_AREA_END1:12;
				uint32_t RESERVED28:3;
				uint32_t DMES1:1;
			};
			uint32_t val;
		} SCAR_CUR1;
	__IO union {
			struct {
				uint32_t SEC_AREA_START1:12;
				uint32_t RESERVED12:4;
				uint32_t SEC_AREA_END1:12;
				uint32_t RESERVED28:3;
				uint32_t DMES1:1;
			};
			uint32_t val;
		} SCAR_PRG1;
	__IO union {
			struct {
				uint32_t WRPSn1:8;
				uint32_t RESERVED8:24;
			};
			uint32_t val;
		} WPSN_CUR1R;
	__IO union {
			struct {
				uint32_t WRPSn1:8;
				uint32_t RESERVED8:24;
			};
			uint32_t val;
		} WPSN_PRG1R;
	__IO union {
			struct {
				uint32_t BOOT_ADD0:16;
				uint32_t BOOT_ADD1:16;
			};
			uint32_t val;
		} BOOT_CURR;
	__IO union {
			struct {
				uint32_t BOOT_ADD0:16;
				uint32_t BOOT_ADD1:16;
			};
			uint32_t val;
		} BOOT_PRGR;
	uint32_t RESERVED18;
	uint32_t RESERVED19;
	__IO union {
			struct {
				uint32_t CRC_SECT:3;
				uint32_t RESERVED3:4;
				uint32_t ALL_BANK:1;
				uint32_t CRC_BY_SECT:1;
				uint32_t ADD_SECT:1;
				uint32_t CLEAN_SECT:1;
				uint32_t RESERVED11:5;
				uint32_t START_CRC:1;
				uint32_t CLEAN_CRC:1;
				uint32_t RESERVED18:2;
				uint32_t CRC_BURST:2;
				uint32_t RESERVED22:10;
			};
			uint32_t val;
		} CRCCR1;
	__IO union {
			struct {
				uint32_t RESERVED0:2;
				uint32_t CRC_START_ADDR:18;
				uint32_t RESERVED20:12;
			};
			uint32_t val;
		} CRCSADD1R;
	__IO union {
			struct {
				uint32_t RESERVED0:2;
				uint32_t CRC_END_ADDR:18;
				uint32_t RESERVED20:12;
			};
			uint32_t val;
		} CRCEADD1R;
	__IO union {
			struct {
				uint32_t CRC_DATA:32;
			};
			uint32_t val;
		} CRCDATAR;
	__IO union {
			struct {
				uint32_t FAIL_ECC_ADDR1:15;
				uint32_t RESERVED15:17;
			};
			uint32_t val;
		} ECC_FA1R;
	uint32_t RESERVED25;
	uint32_t RESERVED26;
	uint32_t RESERVED27;
	uint32_t RESERVED28;
	uint32_t RESERVED29;
	uint32_t RESERVED30;
	uint32_t RESERVED31;
	uint32_t RESERVED32;
	uint32_t RESERVED33;
	uint32_t RESERVED34;
	uint32_t RESERVED35;
	uint32_t RESERVED36;
	uint32_t RESERVED37;
	uint32_t RESERVED38;
	uint32_t RESERVED39;
	uint32_t RESERVED40;
	uint32_t RESERVED41;
	uint32_t RESERVED42;
	uint32_t RESERVED43;
	uint32_t RESERVED44;
	uint32_t RESERVED45;
	uint32_t RESERVED46;
	uint32_t RESERVED47;
	uint32_t RESERVED48;
	uint32_t RESERVED49;
	uint32_t RESERVED50;
	uint32_t RESERVED51;
	uint32_t RESERVED52;
	uint32_t RESERVED53;
	uint32_t RESERVED54;
	uint32_t RESERVED55;
	uint32_t RESERVED56;
	uint32_t RESERVED57;
	uint32_t RESERVED58;
	uint32_t RESERVED59;
	uint32_t RESERVED60;
	uint32_t RESERVED61;
	uint32_t RESERVED62;
	uint32_t RESERVED63;
	__IO union {
			struct {
				uint32_t LATENCY:4;
				uint32_t WRHIGHFREQ:2;
				uint32_t RESERVED6:26;
			};
			uint32_t val;
		} ACR_;
	__IO union {
			struct {
				uint32_t KEYR2:32;
			};
			uint32_t val;
		} KEYR2;
	__IO union {
			struct {
				uint32_t OPTKEYR:32;
			};
			uint32_t val;
		} OPTKEYR_;
	__IO union {
			struct {
				uint32_t LOCK2:1;
				uint32_t PG2:1;
				uint32_t SER2:1;
				uint32_t BER2:1;
				uint32_t PSIZE2:2;
				uint32_t FW2:1;
				uint32_t START2:1;
				uint32_t SNB2:3;
				uint32_t RESERVED11:3;
				uint32_t SPSS2:1;
				uint32_t CRC_EN:1;
				uint32_t EOPIE2:1;
				uint32_t WRPERRIE2:1;
				uint32_t PGSERRIE2:1;
				uint32_t STRBERRIE2:1;
				uint32_t RESERVED20:1;
				uint32_t INCERRIE2:1;
				uint32_t OPERRIE2:1;
				uint32_t RDPERRIE2:1;
				uint32_t RDSERRIE2:1;
				uint32_t SNECCERRIE2:1;
				uint32_t DBECCERRIE2:1;
				uint32_t CRCENDIE2:1;
				uint32_t CRCRDERRIE2:1;
				uint32_t RESERVED29:3;
			};
			uint32_t val;
		} CR2;
	__IO union {
			struct {
				uint32_t BSY2:1;
				uint32_t WBNE2:1;
				uint32_t QW2:1;
				uint32_t CRC_BUSY2:1;
				uint32_t RESERVED4:12;
				uint32_t EOP2:1;
				uint32_t WRPERR2:1;
				uint32_t PGSERR2:1;
				uint32_t STRBERR2:1;
				uint32_t RESERVED20:1;
				uint32_t INCERR2:1;
				uint32_t OPERR2:1;
				uint32_t RDPERR2:1;
				uint32_t RDSERR2:1;
				uint32_t SNECCERR2:1;
				uint32_t DBECCERR2:1;
				uint32_t CRCEND2:1;
				uint32_t RESERVED28:4;
			};
			uint32_t val;
		} SR2;
	__IO union {
			struct {
				uint32_t RESERVED0:16;
				uint32_t CLR_EOP2:1;
				uint32_t CLR_WRPERR2:1;
				uint32_t CLR_PGSERR2:1;
				uint32_t CLR_STRBERR2:1;
				uint32_t RESERVED20:1;
				uint32_t CLR_INCERR2:1;
				uint32_t CLR_OPERR2:1;
				uint32_t CLR_RDPERR2:1;
				uint32_t CLR_RDSERR1:1;
				uint32_t CLR_SNECCERR2:1;
				uint32_t CLR_DBECCERR1:1;
				uint32_t CLR_CRCEND2:1;
				uint32_t RESERVED28:4;
			};
			uint32_t val;
		} CCR2;
	__IO union {
			struct {
				uint32_t OPTLOCK:1;
				uint32_t OPTSTART:1;
				uint32_t RESERVED2:2;
				uint32_t MER:1;
				uint32_t RESERVED5:25;
				uint32_t OPTCHANGEERRIE:1;
				uint32_t SWAP_BANK:1;
			};
			uint32_t val;
		} OPTCR_;
	__IO union {
			struct {
				uint32_t OPT_BUSY:1;
				uint32_t RESERVED1:1;
				uint32_t BOR_LEV:2;
				uint32_t IWDG1_SW:1;
				uint32_t RESERVED5:1;
				uint32_t NRST_STOP_D1:1;
				uint32_t NRST_STBY_D1:1;
				uint32_t RDP:8;
				uint32_t RESERVED16:1;
				uint32_t IWDG_FZ_STOP:1;
				uint32_t IWDG_FZ_SDBY:1;
				uint32_t ST_RAM_SIZE:2;
				uint32_t SECURITY:1;
				uint32_t RESERVED22:7;
				uint32_t IO_HSLV:1;
				uint32_t OPTCHANGEERR:1;
				uint32_t SWAP_BANK_OPT:1;
			};
			uint32_t val;
		} OPTSR_CUR_;
	__IO union {
			struct {
				uint32_t RESERVED0:2;
				uint32_t BOR_LEV:2;
				uint32_t IWDG1_SW:1;
				uint32_t RESERVED5:1;
				uint32_t nRST_STOP:1;
				uint32_t nRST_STDY:1;
				uint32_t RDP:8;
				uint32_t RESERVED16:1;
				uint32_t FZ_IWDG_STOP:1;
				uint32_t FZ_IWDG_SDBY:1;
				uint32_t ST_RAM_SIZE:2;
				uint32_t SECURITY:1;
				uint32_t RESERVED22:7;
				uint32_t IO_HSLV:1;
				uint32_t RESERVED30:1;
				uint32_t SWAP_BANK_OPT:1;
			};
			uint32_t val;
		} OPTSR_PRG_;
	__IO union {
			struct {
				uint32_t RESERVED0:30;
				uint32_t CLR_OPTCHANGEERR:1;
				uint32_t RESERVED31:1;
			};
			uint32_t val;
		} OPTCCR_;
	__IO union {
			struct {
				uint32_t PROT_AREA_START2:12;
				uint32_t RESERVED12:4;
				uint32_t PROT_AREA_END2:12;
				uint32_t RESERVED28:3;
				uint32_t DMEP2:1;
			};
			uint32_t val;
		} PRAR_CUR2;
	__IO union {
			struct {
				uint32_t PROT_AREA_START2:12;
				uint32_t RESERVED12:4;
				uint32_t PROT_AREA_END2:12;
				uint32_t RESERVED28:3;
				uint32_t DMEP2:1;
			};
			uint32_t val;
		} PRAR_PRG2;
	__IO union {
			struct {
				uint32_t SEC_AREA_START2:12;
				uint32_t RESERVED12:4;
				uint32_t SEC_AREA_END2:12;
				uint32_t RESERVED28:3;
				uint32_t DMES2:1;
			};
			uint32_t val;
		} SCAR_CUR2;
	__IO union {
			struct {
				uint32_t SEC_AREA_START2:12;
				uint32_t RESERVED12:4;
				uint32_t SEC_AREA_END2:12;
				uint32_t RESERVED28:3;
				uint32_t DMES2:1;
			};
			uint32_t val;
		} SCAR_PRG2;
	__IO union {
			struct {
				uint32_t WRPSn2:8;
				uint32_t RESERVED8:24;
			};
			uint32_t val;
		} WPSN_CUR2R;
	__IO union {
			struct {
				uint32_t WRPSn2:8;
				uint32_t RESERVED8:24;
			};
			uint32_t val;
		} WPSN_PRG2R;
	__IO union {
			struct {
				uint32_t BOOT_ADD0:16;
				uint32_t BOOT_ADD1:16;
			};
			uint32_t val;
		} BOOT_CURR_;
	__IO union {
			struct {
				uint32_t BOOT_ADD0:16;
				uint32_t BOOT_ADD1:16;
			};
			uint32_t val;
		} BOOT_PRGR_;
	uint32_t RESERVED82;
	uint32_t RESERVED83;
	__IO union {
			struct {
				uint32_t CRC_SECT:3;
				uint32_t RESERVED3:4;
				uint32_t ALL_BANK:1;
				uint32_t CRC_BY_SECT:1;
				uint32_t ADD_SECT:1;
				uint32_t CLEAN_SECT:1;
				uint32_t RESERVED11:5;
				uint32_t START_CRC:1;
				uint32_t CLEAN_CRC:1;
				uint32_t RESERVED18:2;
				uint32_t CRC_BURST:2;
				uint32_t RESERVED22:10;
			};
			uint32_t val;
		} CRCCR2;
	__IO union {
			struct {
				uint32_t RESERVED0:2;
				uint32_t CRC_START_ADDR:18;
				uint32_t RESERVED20:12;
			};
			uint32_t val;
		} CRCSADD2R;
	__IO union {
			struct {
				uint32_t RESERVED0:2;
				uint32_t CRC_END_ADDR:18;
				uint32_t RESERVED20:12;
			};
			uint32_t val;
		} CRCEADD2R;
	__IO union {
			struct {
				uint32_t CRC_DATA:32;
			};
			uint32_t val;
		} CRCDATAR_;
	__IO union {
			struct {
				uint32_t FAIL_ECC_ADDR2:15;
				uint32_t RESERVED15:17;
			};
			uint32_t val;
		} ECC_FA2R;
} MyFlash_TypeDef;

