minichao9901/my_stm32_projects/stm32h750_simple_reg/CORE/stm32h750_typedefs.h
typedef struct {
	__IO union {
			struct {
				uint32_t FEIF0:1;
				uint32_t RESERVED1:1;
				uint32_t DMEIF0:1;
				uint32_t TEIF0:1;
				uint32_t HTIF0:1;
				uint32_t TCIF0:1;
				uint32_t FEIF1:1;
				uint32_t RESERVED7:1;
				uint32_t DMEIF1:1;
				uint32_t TEIF1:1;
				uint32_t HTIF1:1;
				uint32_t TCIF1:1;
				uint32_t RESERVED12:4;
				uint32_t FEIF2:1;
				uint32_t RESERVED17:1;
				uint32_t DMEIF2:1;
				uint32_t TEIF2:1;
				uint32_t HTIF2:1;
				uint32_t TCIF2:1;
				uint32_t FEIF3:1;
				uint32_t RESERVED23:1;
				uint32_t DMEIF3:1;
				uint32_t TEIF3:1;
				uint32_t HTIF3:1;
				uint32_t TCIF3:1;
				uint32_t RESERVED28:4;
			};
			uint32_t val;
		} LISR;
	__IO union {
			struct {
				uint32_t FEIF4:1;
				uint32_t RESERVED1:1;
				uint32_t DMEIF4:1;
				uint32_t TEIF4:1;
				uint32_t HTIF4:1;
				uint32_t TCIF4:1;
				uint32_t FEIF5:1;
				uint32_t RESERVED7:1;
				uint32_t DMEIF5:1;
				uint32_t TEIF5:1;
				uint32_t HTIF5:1;
				uint32_t TCIF5:1;
				uint32_t RESERVED12:4;
				uint32_t FEIF6:1;
				uint32_t RESERVED17:1;
				uint32_t DMEIF6:1;
				uint32_t TEIF6:1;
				uint32_t HTIF6:1;
				uint32_t TCIF6:1;
				uint32_t FEIF7:1;
				uint32_t RESERVED23:1;
				uint32_t DMEIF7:1;
				uint32_t TEIF7:1;
				uint32_t HTIF7:1;
				uint32_t TCIF7:1;
				uint32_t RESERVED28:4;
			};
			uint32_t val;
		} HISR;
	__IO union {
			struct {
				uint32_t CFEIF0:1;
				uint32_t RESERVED1:1;
				uint32_t CDMEIF0:1;
				uint32_t CTEIF0:1;
				uint32_t CHTIF0:1;
				uint32_t CTCIF0:1;
				uint32_t CFEIF1:1;
				uint32_t RESERVED7:1;
				uint32_t CDMEIF1:1;
				uint32_t CTEIF1:1;
				uint32_t CHTIF1:1;
				uint32_t CTCIF1:1;
				uint32_t RESERVED12:4;
				uint32_t CFEIF2:1;
				uint32_t RESERVED17:1;
				uint32_t CDMEIF2:1;
				uint32_t CTEIF2:1;
				uint32_t CHTIF2:1;
				uint32_t CTCIF2:1;
				uint32_t CFEIF3:1;
				uint32_t RESERVED23:1;
				uint32_t CDMEIF3:1;
				uint32_t CTEIF3:1;
				uint32_t CHTIF3:1;
				uint32_t CTCIF3:1;
				uint32_t RESERVED28:4;
			};
			uint32_t val;
		} LIFCR;
	__IO union {
			struct {
				uint32_t CFEIF4:1;
				uint32_t RESERVED1:1;
				uint32_t CDMEIF4:1;
				uint32_t CTEIF4:1;
				uint32_t CHTIF4:1;
				uint32_t CTCIF4:1;
				uint32_t CFEIF5:1;
				uint32_t RESERVED7:1;
				uint32_t CDMEIF5:1;
				uint32_t CTEIF5:1;
				uint32_t CHTIF5:1;
				uint32_t CTCIF5:1;
				uint32_t RESERVED12:4;
				uint32_t CFEIF6:1;
				uint32_t RESERVED17:1;
				uint32_t CDMEIF6:1;
				uint32_t CTEIF6:1;
				uint32_t CHTIF6:1;
				uint32_t CTCIF6:1;
				uint32_t CFEIF7:1;
				uint32_t RESERVED23:1;
				uint32_t CDMEIF7:1;
				uint32_t CTEIF7:1;
				uint32_t CHTIF7:1;
				uint32_t CTCIF7:1;
				uint32_t RESERVED28:4;
			};
			uint32_t val;
		} HIFCR;
	__IO union {
			struct {
				uint32_t EN:1;
				uint32_t DMEIE:1;
				uint32_t TEIE:1;
				uint32_t HTIE:1;
				uint32_t TCIE:1;
				uint32_t PFCTRL:1;
				uint32_t DIR:2;
				uint32_t CIRC:1;
				uint32_t PINC:1;
				uint32_t MINC:1;
				uint32_t PSIZE:2;
				uint32_t MSIZE:2;
				uint32_t PINCOS:1;
				uint32_t PL:2;
				uint32_t DBM:1;
				uint32_t CT:1;
				uint32_t RESERVED20:1;
				uint32_t PBURST:2;
				uint32_t MBURST:2;
				uint32_t RESERVED25:7;
			};
			uint32_t val;
		} S0CR;
	__IO union {
			struct {
				uint32_t NDT:16;
				uint32_t RESERVED16:16;
			};
			uint32_t val;
		} S0NDTR;
	__IO union {
			struct {
				uint32_t PA:32;
			};
			uint32_t val;
		} S0PAR;
	__IO union {
			struct {
				uint32_t M0A:32;
			};
			uint32_t val;
		} S0M0AR;
	__IO union {
			struct {
				uint32_t M1A:32;
			};
			uint32_t val;
		} S0M1AR;
	__IO union {
			struct {
				uint32_t FTH:2;
				uint32_t DMDIS:1;
				uint32_t FS:3;
				uint32_t RESERVED6:1;
				uint32_t FEIE:1;
				uint32_t RESERVED8:24;
			};
			uint32_t val;
		} S0FCR;
	__IO union {
			struct {
				uint32_t EN:1;
				uint32_t DMEIE:1;
				uint32_t TEIE:1;
				uint32_t HTIE:1;
				uint32_t TCIE:1;
				uint32_t PFCTRL:1;
				uint32_t DIR:2;
				uint32_t CIRC:1;
				uint32_t PINC:1;
				uint32_t MINC:1;
				uint32_t PSIZE:2;
				uint32_t MSIZE:2;
				uint32_t PINCOS:1;
				uint32_t PL:2;
				uint32_t DBM:1;
				uint32_t CT:1;
				uint32_t ACK:1;
				uint32_t PBURST:2;
				uint32_t MBURST:2;
				uint32_t RESERVED25:7;
			};
			uint32_t val;
		} S1CR;
	__IO union {
			struct {
				uint32_t NDT:16;
				uint32_t RESERVED16:16;
			};
			uint32_t val;
		} S1NDTR;
	__IO union {
			struct {
				uint32_t PA:32;
			};
			uint32_t val;
		} S1PAR;
	__IO union {
			struct {
				uint32_t M0A:32;
			};
			uint32_t val;
		} S1M0AR;
	__IO union {
			struct {
				uint32_t M1A:32;
			};
			uint32_t val;
		} S1M1AR;
	__IO union {
			struct {
				uint32_t FTH:2;
				uint32_t DMDIS:1;
				uint32_t FS:3;
				uint32_t RESERVED6:1;
				uint32_t FEIE:1;
				uint32_t RESERVED8:24;
			};
			uint32_t val;
		} S1FCR;
	__IO union {
			struct {
				uint32_t EN:1;
				uint32_t DMEIE:1;
				uint32_t TEIE:1;
				uint32_t HTIE:1;
				uint32_t TCIE:1;
				uint32_t PFCTRL:1;
				uint32_t DIR:2;
				uint32_t CIRC:1;
				uint32_t PINC:1;
				uint32_t MINC:1;
				uint32_t PSIZE:2;
				uint32_t MSIZE:2;
				uint32_t PINCOS:1;
				uint32_t PL:2;
				uint32_t DBM:1;
				uint32_t CT:1;
				uint32_t ACK:1;
				uint32_t PBURST:2;
				uint32_t MBURST:2;
				uint32_t RESERVED25:7;
			};
			uint32_t val;
		} S2CR;
	__IO union {
			struct {
				uint32_t NDT:16;
				uint32_t RESERVED16:16;
			};
			uint32_t val;
		} S2NDTR;
	__IO union {
			struct {
				uint32_t PA:32;
			};
			uint32_t val;
		} S2PAR;
	__IO union {
			struct {
				uint32_t M0A:32;
			};
			uint32_t val;
		} S2M0AR;
	__IO union {
			struct {
				uint32_t M1A:32;
			};
			uint32_t val;
		} S2M1AR;
	__IO union {
			struct {
				uint32_t FTH:2;
				uint32_t DMDIS:1;
				uint32_t FS:3;
				uint32_t RESERVED6:1;
				uint32_t FEIE:1;
				uint32_t RESERVED8:24;
			};
			uint32_t val;
		} S2FCR;
	__IO union {
			struct {
				uint32_t EN:1;
				uint32_t DMEIE:1;
				uint32_t TEIE:1;
				uint32_t HTIE:1;
				uint32_t TCIE:1;
				uint32_t PFCTRL:1;
				uint32_t DIR:2;
				uint32_t CIRC:1;
				uint32_t PINC:1;
				uint32_t MINC:1;
				uint32_t PSIZE:2;
				uint32_t MSIZE:2;
				uint32_t PINCOS:1;
				uint32_t PL:2;
				uint32_t DBM:1;
				uint32_t CT:1;
				uint32_t ACK:1;
				uint32_t PBURST:2;
				uint32_t MBURST:2;
				uint32_t RESERVED25:7;
			};
			uint32_t val;
		} S3CR;
	__IO union {
			struct {
				uint32_t NDT:16;
				uint32_t RESERVED16:16;
			};
			uint32_t val;
		} S3NDTR;
	__IO union {
			struct {
				uint32_t PA:32;
			};
			uint32_t val;
		} S3PAR;
	__IO union {
			struct {
				uint32_t M0A:32;
			};
			uint32_t val;
		} S3M0AR;
	__IO union {
			struct {
				uint32_t M1A:32;
			};
			uint32_t val;
		} S3M1AR;
	__IO union {
			struct {
				uint32_t FTH:2;
				uint32_t DMDIS:1;
				uint32_t FS:3;
				uint32_t RESERVED6:1;
				uint32_t FEIE:1;
				uint32_t RESERVED8:24;
			};
			uint32_t val;
		} S3FCR;
	__IO union {
			struct {
				uint32_t EN:1;
				uint32_t DMEIE:1;
				uint32_t TEIE:1;
				uint32_t HTIE:1;
				uint32_t TCIE:1;
				uint32_t PFCTRL:1;
				uint32_t DIR:2;
				uint32_t CIRC:1;
				uint32_t PINC:1;
				uint32_t MINC:1;
				uint32_t PSIZE:2;
				uint32_t MSIZE:2;
				uint32_t PINCOS:1;
				uint32_t PL:2;
				uint32_t DBM:1;
				uint32_t CT:1;
				uint32_t ACK:1;
				uint32_t PBURST:2;
				uint32_t MBURST:2;
				uint32_t RESERVED25:7;
			};
			uint32_t val;
		} S4CR;
	__IO union {
			struct {
				uint32_t NDT:16;
				uint32_t RESERVED16:16;
			};
			uint32_t val;
		} S4NDTR;
	__IO union {
			struct {
				uint32_t PA:32;
			};
			uint32_t val;
		} S4PAR;
	__IO union {
			struct {
				uint32_t M0A:32;
			};
			uint32_t val;
		} S4M0AR;
	__IO union {
			struct {
				uint32_t M1A:32;
			};
			uint32_t val;
		} S4M1AR;
	__IO union {
			struct {
				uint32_t FTH:2;
				uint32_t DMDIS:1;
				uint32_t FS:3;
				uint32_t RESERVED6:1;
				uint32_t FEIE:1;
				uint32_t RESERVED8:24;
			};
			uint32_t val;
		} S4FCR;
	__IO union {
			struct {
				uint32_t EN:1;
				uint32_t DMEIE:1;
				uint32_t TEIE:1;
				uint32_t HTIE:1;
				uint32_t TCIE:1;
				uint32_t PFCTRL:1;
				uint32_t DIR:2;
				uint32_t CIRC:1;
				uint32_t PINC:1;
				uint32_t MINC:1;
				uint32_t PSIZE:2;
				uint32_t MSIZE:2;
				uint32_t PINCOS:1;
				uint32_t PL:2;
				uint32_t DBM:1;
				uint32_t CT:1;
				uint32_t ACK:1;
				uint32_t PBURST:2;
				uint32_t MBURST:2;
				uint32_t RESERVED25:7;
			};
			uint32_t val;
		} S5CR;
	__IO union {
			struct {
				uint32_t NDT:16;
				uint32_t RESERVED16:16;
			};
			uint32_t val;
		} S5NDTR;
	__IO union {
			struct {
				uint32_t PA:32;
			};
			uint32_t val;
		} S5PAR;
	__IO union {
			struct {
				uint32_t M0A:32;
			};
			uint32_t val;
		} S5M0AR;
	__IO union {
			struct {
				uint32_t M1A:32;
			};
			uint32_t val;
		} S5M1AR;
	__IO union {
			struct {
				uint32_t FTH:2;
				uint32_t DMDIS:1;
				uint32_t FS:3;
				uint32_t RESERVED6:1;
				uint32_t FEIE:1;
				uint32_t RESERVED8:24;
			};
			uint32_t val;
		} S5FCR;
	__IO union {
			struct {
				uint32_t EN:1;
				uint32_t DMEIE:1;
				uint32_t TEIE:1;
				uint32_t HTIE:1;
				uint32_t TCIE:1;
				uint32_t PFCTRL:1;
				uint32_t DIR:2;
				uint32_t CIRC:1;
				uint32_t PINC:1;
				uint32_t MINC:1;
				uint32_t PSIZE:2;
				uint32_t MSIZE:2;
				uint32_t PINCOS:1;
				uint32_t PL:2;
				uint32_t DBM:1;
				uint32_t CT:1;
				uint32_t ACK:1;
				uint32_t PBURST:2;
				uint32_t MBURST:2;
				uint32_t RESERVED25:7;
			};
			uint32_t val;
		} S6CR;
	__IO union {
			struct {
				uint32_t NDT:16;
				uint32_t RESERVED16:16;
			};
			uint32_t val;
		} S6NDTR;
	__IO union {
			struct {
				uint32_t PA:32;
			};
			uint32_t val;
		} S6PAR;
	__IO union {
			struct {
				uint32_t M0A:32;
			};
			uint32_t val;
		} S6M0AR;
	__IO union {
			struct {
				uint32_t M1A:32;
			};
			uint32_t val;
		} S6M1AR;
	__IO union {
			struct {
				uint32_t FTH:2;
				uint32_t DMDIS:1;
				uint32_t FS:3;
				uint32_t RESERVED6:1;
				uint32_t FEIE:1;
				uint32_t RESERVED8:24;
			};
			uint32_t val;
		} S6FCR;
	__IO union {
			struct {
				uint32_t EN:1;
				uint32_t DMEIE:1;
				uint32_t TEIE:1;
				uint32_t HTIE:1;
				uint32_t TCIE:1;
				uint32_t PFCTRL:1;
				uint32_t DIR:2;
				uint32_t CIRC:1;
				uint32_t PINC:1;
				uint32_t MINC:1;
				uint32_t PSIZE:2;
				uint32_t MSIZE:2;
				uint32_t PINCOS:1;
				uint32_t PL:2;
				uint32_t DBM:1;
				uint32_t CT:1;
				uint32_t ACK:1;
				uint32_t PBURST:2;
				uint32_t MBURST:2;
				uint32_t RESERVED25:7;
			};
			uint32_t val;
		} S7CR;
	__IO union {
			struct {
				uint32_t NDT:16;
				uint32_t RESERVED16:16;
			};
			uint32_t val;
		} S7NDTR;
	__IO union {
			struct {
				uint32_t PA:32;
			};
			uint32_t val;
		} S7PAR;
	__IO union {
			struct {
				uint32_t M0A:32;
			};
			uint32_t val;
		} S7M0AR;
	__IO union {
			struct {
				uint32_t M1A:32;
			};
			uint32_t val;
		} S7M1AR;
	__IO union {
			struct {
				uint32_t FTH:2;
				uint32_t DMDIS:1;
				uint32_t FS:3;
				uint32_t RESERVED6:1;
				uint32_t FEIE:1;
				uint32_t RESERVED8:24;
			};
			uint32_t val;
		} S7FCR;
} MyDMA1_TypeDef;

