minichao9901/my_stm32_projects/stm32h750_simple_reg/CORE/stm32h750_typedefs.h
typedef struct {
	__IO union {
			struct {
				uint32_t UE:1;
				uint32_t UESM:1;
				uint32_t RE:1;
				uint32_t TE:1;
				uint32_t IDLEIE:1;
				uint32_t RXNEIE:1;
				uint32_t TCIE:1;
				uint32_t TXEIE:1;
				uint32_t PEIE:1;
				uint32_t PS:1;
				uint32_t PCE:1;
				uint32_t WAKE:1;
				uint32_t M0:1;
				uint32_t MME:1;
				uint32_t CMIE:1;
				uint32_t OVER8:1;
				uint32_t DEDT0:1;
				uint32_t DEDT1:1;
				uint32_t DEDT2:1;
				uint32_t DEDT3:1;
				uint32_t DEDT4:1;
				uint32_t DEAT0:1;
				uint32_t DEAT1:1;
				uint32_t DEAT2:1;
				uint32_t DEAT3:1;
				uint32_t DEAT4:1;
				uint32_t RTOIE:1;
				uint32_t EOBIE:1;
				uint32_t M1:1;
				uint32_t FIFOEN:1;
				uint32_t TXFEIE:1;
				uint32_t RXFFIE:1;
			};
			uint32_t val;
		} CR1;
	__IO union {
			struct {
				uint32_t SLVEN:1;
				uint32_t RESERVED1:2;
				uint32_t DIS_NSS:1;
				uint32_t ADDM7:1;
				uint32_t LBDL:1;
				uint32_t LBDIE:1;
				uint32_t RESERVED7:1;
				uint32_t LBCL:1;
				uint32_t CPHA:1;
				uint32_t CPOL:1;
				uint32_t CLKEN:1;
				uint32_t STOP:2;
				uint32_t LINEN:1;
				uint32_t SWAP:1;
				uint32_t RXINV:1;
				uint32_t TXINV:1;
				uint32_t TAINV:1;
				uint32_t MSBFIRST:1;
				uint32_t ABREN:1;
				uint32_t ABRMOD0:1;
				uint32_t ABRMOD1:1;
				uint32_t RTOEN:1;
				uint32_t ADD0_3:4;
				uint32_t ADD4_7:4;
			};
			uint32_t val;
		} CR2;
	__IO union {
			struct {
				uint32_t EIE:1;
				uint32_t IREN:1;
				uint32_t IRLP:1;
				uint32_t HDSEL:1;
				uint32_t NACK:1;
				uint32_t SCEN:1;
				uint32_t DMAR:1;
				uint32_t DMAT:1;
				uint32_t RTSE:1;
				uint32_t CTSE:1;
				uint32_t CTSIE:1;
				uint32_t ONEBIT:1;
				uint32_t OVRDIS:1;
				uint32_t DDRE:1;
				uint32_t DEM:1;
				uint32_t DEP:1;
				uint32_t RESERVED16:1;
				uint32_t SCARCNT:3;
				uint32_t WUS:2;
				uint32_t WUFIE:1;
				uint32_t TXFTIE:1;
				uint32_t TCBGTIE:1;
				uint32_t RXFTCFG:3;
				uint32_t RXFTIE:1;
				uint32_t TXFTCFG:3;
			};
			uint32_t val;
		} CR3;
	__IO union {
			struct {
				uint32_t BRR_0_3:4;
				uint32_t BRR_4_15:12;
				uint32_t RESERVED16:16;
			};
			uint32_t val;
		} BRR;
	__IO union {
			struct {
				uint32_t PSC:8;
				uint32_t GT:8;
				uint32_t RESERVED16:16;
			};
			uint32_t val;
		} GTPR;
	__IO union {
			struct {
				uint32_t RTO:24;
				uint32_t BLEN:8;
			};
			uint32_t val;
		} RTOR;
	__IO union {
			struct {
				uint32_t ABRRQ:1;
				uint32_t SBKRQ:1;
				uint32_t MMRQ:1;
				uint32_t RXFRQ:1;
				uint32_t TXFRQ:1;
				uint32_t RESERVED5:27;
			};
			uint32_t val;
		} RQR;
	__IO union {
			struct {
				uint32_t PE:1;
				uint32_t FE:1;
				uint32_t NF:1;
				uint32_t ORE:1;
				uint32_t IDLE:1;
				uint32_t RXNE:1;
				uint32_t TC:1;
				uint32_t TXE:1;
				uint32_t LBDF:1;
				uint32_t CTSIF:1;
				uint32_t CTS:1;
				uint32_t RTOF:1;
				uint32_t EOBF:1;
				uint32_t UDR:1;
				uint32_t ABRE:1;
				uint32_t ABRF:1;
				uint32_t BUSY:1;
				uint32_t CMF:1;
				uint32_t SBKF:1;
				uint32_t RWU:1;
				uint32_t WUF:1;
				uint32_t TEACK:1;
				uint32_t REACK:1;
				uint32_t TXFE:1;
				uint32_t RXFF:1;
				uint32_t TCBGT:1;
				uint32_t RXFT:1;
				uint32_t TXFT:1;
				uint32_t RESERVED28:4;
			};
			uint32_t val;
		} ISR;
	__IO union {
			struct {
				uint32_t PECF:1;
				uint32_t FECF:1;
				uint32_t NCF:1;
				uint32_t ORECF:1;
				uint32_t IDLECF:1;
				uint32_t TXFECF:1;
				uint32_t TCCF:1;
				uint32_t TCBGTC:1;
				uint32_t LBDCF:1;
				uint32_t CTSCF:1;
				uint32_t RESERVED10:1;
				uint32_t RTOCF:1;
				uint32_t EOBCF:1;
				uint32_t UDRCF:1;
				uint32_t RESERVED14:3;
				uint32_t CMCF:1;
				uint32_t RESERVED18:2;
				uint32_t WUCF:1;
				uint32_t RESERVED21:11;
			};
			uint32_t val;
		} ICR;
	__IO union {
			struct {
				uint32_t RDR:9;
				uint32_t RESERVED9:23;
			};
			uint32_t val;
		} RDR;
	__IO union {
			struct {
				uint32_t TDR:9;
				uint32_t RESERVED9:23;
			};
			uint32_t val;
		} TDR;
	__IO union {
			struct {
				uint32_t PRESCALER:4;
				uint32_t RESERVED4:28;
			};
			uint32_t val;
		} PRESC;
} MyUSART1_TypeDef;

//typedef struct {
//} MyUART4_TypeDef;

#define MyFMC_BASE 0x52004000
#define MyFMC ((volatile MyFMC_TypeDef *)(MyFMC_BASE))

#define MyGPIOA_BASE 0x58020000
#define MyGPIOA ((volatile MyGPIOA_TypeDef *)(MyGPIOA_BASE))

#define MyGPIOB_BASE 0x58020400
#define MyGPIOB ((volatile MyGPIOA_TypeDef *)(MyGPIOB_BASE))

#define MyGPIOC_BASE 0x58020800
#define MyGPIOC ((volatile MyGPIOA_TypeDef *)(MyGPIOC_BASE))

#define MyGPIOD_BASE 0x58020C00
#define MyGPIOD ((volatile MyGPIOA_TypeDef *)(MyGPIOD_BASE))

#define MyGPIOE_BASE 0x58021000
#define MyGPIOE ((volatile MyGPIOA_TypeDef *)(MyGPIOE_BASE))

#define MyGPIOF_BASE 0x58021400
#define MyGPIOF ((volatile MyGPIOA_TypeDef *)(MyGPIOF_BASE))

#define MyGPIOG_BASE 0x58021800
#define MyGPIOG ((volatile MyGPIOA_TypeDef *)(MyGPIOG_BASE))

#define MyGPIOH_BASE 0x58021C00
#define MyGPIOH ((volatile MyGPIOA_TypeDef *)(MyGPIOH_BASE))

#define MyGPIOI_BASE 0x58022000
#define MyGPIOI ((volatile MyGPIOA_TypeDef *)(MyGPIOI_BASE))

#define MyGPIOJ_BASE 0x58022400
#define MyGPIOJ ((volatile MyGPIOA_TypeDef *)(MyGPIOJ_BASE))

#define MyGPIOK_BASE 0x58022800
#define MyGPIOK ((volatile MyGPIOA_TypeDef *)(MyGPIOK_BASE))

#define MyQUADSPI_BASE 0x52005000
#define MyQUADSPI ((volatile MyQUADSPI_TypeDef *)(MyQUADSPI_BASE))

#define MyPWR_BASE 0x58024800
#define MyPWR ((volatile MyPWR_TypeDef *)(MyPWR_BASE))

#define MySPI1_BASE 0x40013000
#define MySPI1 ((volatile MySPI1_TypeDef *)(MySPI1_BASE))

#define MyLTDC_BASE 0x50001000
#define MyLTDC ((volatile MyLTDC_TypeDef *)(MyLTDC_BASE))

#define MyRCC_BASE 0x58024400
#define MyRCC ((volatile MyRCC_TypeDef *)(MyRCC_BASE))

#define MyEXTI_BASE 0x58000000
#define MyEXTI ((volatile MyEXTI_TypeDef *)(MyEXTI_BASE))

#define MyFlash_BASE 0x52002000
#define MyFlash ((volatile MyFlash_TypeDef *)(MyFlash_BASE))

#define MyDMA1_BASE 0x40020000
#define MyDMA1 ((volatile MyDMA1_TypeDef *)(MyDMA1_BASE))

#define MyUSART1_BASE 0x40011000
#define MyUSART1 ((volatile MyUSART1_TypeDef *)(MyUSART1_BASE))

#define MyUART4_BASE 0x40004C00
#define MyUART4 ((volatile MyUSART1_TypeDef *)(MyUART4_BASE))

